<?php
error_reporting(0);
$_classPath = "../../phpshop/";
include($_classPath . "class/obj.class.php");
PHPShopObj::loadClass("base");
PHPShopObj::loadClass("mail");

$PHPShopBase = new PHPShopBase($_classPath . "inc/config.ini");
?>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<title><?php echo $SysValue['license']['product_name'] ?> -> Установка обновления</title>
<META http-equiv=Content-Type content="text/html; charset=windows-1251">
<META name="ROBOTS" content="NONE">
<link href="<?php echo $SysValue['dir']['dir'] ?>/phpshop/admpanel/skins/1c/texts.css" type=text/css rel=stylesheet>
<script>
    function Warning() {
        return alert("Внимание!\nНе забудте поменять префиксы баз данных в установочном файле config.ini");
    }

    function InstallOk() {
        window.opener.location.replace("/");
        window.close();
    }

    function Readonlys() {
        return alert("Внимание!\nДанные редактирируются только в файле config.ini");
    }

    function ChekRegLic() {
        var s1 = window.document.forms.regForma.selectLic.checked;
        if (s1 === false) {
            if (confirm("Внимание!\nВы  согласны с  лицензионным соглашением?"))
                window.document.forms.regForma.selectLic.checked = true;
        }
        else
            document.regForma.submit();
    }

</script>
</head>
<body bottommargin="0"  topmargin="0" leftmargin="0" rightmargin="0">
    <table cellpadding="0" cellspacing="0" width="100%" height="50" id="title">
        <tr bgcolor="#ffffff">
            <td style="padding:10">
                <b>Обновление интернет-магазина <?php echo $SysValue['license']['product_name'] . " (сборка " . $SysValue['upload']['version'] . ")" ?></b><br>
                &nbsp;&nbsp;&nbsp;Выбор параметров обновления.
            </td>
            <td align="right">
                <img src="<?php echo$SysValue['dir']['dir'] ?>/phpshop/admpanel/img/i_server_info_med[1].gif" border="0" hspace="10">
            </td>
        </tr>
    </table>
    <?php

// Выбор файла
    function GetFile($dir) {
        if ($dh = opendir($dir)) {
            while (($file = readdir($dh)) !== false) {
                $fstat = explode(".", $file);
                if ($fstat[1] == "sql")
                    $fileBase = $file;
            }
            closedir($dh);
        }
        return "./" . $dir . "/" . $fileBase;
    }

    function GetUpdate($skin) {
        $dir = "./";
        $name = null;
        if (is_dir($dir)) {
            if ($dh = opendir($dir)) {
                while (($file = readdir($dh)) !== false) {

                    if ($skin == $file)
                        $sel = "selected";
                    else
                        $sel = "";

                    if ($file != "." and $file != ".." and is_dir($file))
                        $name.= "<option value=\"$file\" $sel>$file</option>";
                }
                closedir($dh);
            }
        }
        $disp = "
<select name=\"update_dir\">
" . $name . "
</select>
";
        return @$disp;
    }

    // Устанавливаем базу
    if ($_POST['install'] == 2) {

        $fileBase = GetFile($_POST['update_dir']);
        $lines = file($_POST['update_dir'] . "/file.txt");
        @$fp = fopen($fileBase, "r");

        if ($fp) {
            stream_set_write_buffer($fp, 0);
            $fstat = fstat($fp);
            $CsvContent = fread($fp, $fstat['size']);
            $CsvContent = str_replace("phpshop_", $_POST['prefix'], $CsvContent);
            fclose($fp);
        }
        $IdsArray2 = split(";", $CsvContent);
        array_pop($IdsArray2);
        while (list($key, $val) = each($IdsArray2))
            $result = mysql_query($val);
        if (@$result) {
            $disp = "<h4>Обновление базы прошло успешно.</h4>
                    ";
            foreach ($lines as $line) {
                @$disp2.=htmlspecialchars($line) . "<br>\n";
            }
            $d = "";
        } else {
            $disp = "<h4>Ошибка установки: " . mysql_error() . " </h4>";
            $d = "disabled";
        }
        ?>
        <TABLE cellSpacing=0 cellPadding=0 width="100%"><TBODY>
                <TR>
                    <TD vAlign=top>
                        <TABLE cellSpacing=1 cellPadding=5 width="50%" align=center border=0>
                            <FORM method=post>
                                <TBODY>
                                    <TR class=adm vAlign=top align=middle>
                                        <TD align=left>
                                            <FIELDSET >
                                                <div align="center" style="padding:10;WIDTH: 545;">
                                                    <?php echo $disp ?>
                                                </div>
                                            </FIELDSET>
                                            <br>
                                            <FIELDSET>
                                                <LEGEND id=lgdLayout >Обновление файлов:</LEGEND>
                                                <div style="padding:10;WIDTH:100%;height:250px;overflow:auto">
                                                    <?php echo $disp2 ?>
                                                </div>
                                            </FIELDSET>
                                        </TD>
                                    </TR></FORM></TBODY></TABLE></TD></TR></TBODY></TABLE>
    <table cellpadding="0" cellspacing="0" width="100%" height="50" style="margin-top:50px">
        <tr>
            <td><hr></td>
        </tr>
        <tr>
            <td align="right" style="padding:10">
                <INPUT class=but type=button value="&laquo; Назад" onclick="history.back(1)">
                <INPUT class=but type=button id="close" value="Готово" onclick="InstallOk()" <?php echo $d ?>>
            </td>
        </tr>
    </form>
    </table>
    <?php
} elseif ($_POST['install'] == 1) {
    ?>
    <div style="padding:5px">
        <FIELDSET id=fldLayout>
            <LEGEND id=lgdLayout >MySQL</LEGEND>
            <br>
            <table cellSpacing=1 cellPadding=5  border=0 width="100%">
                <FORM method="post" name="install">
                    <tr>
                        <td align="right" width="100">Хост:</td>
                        <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly value="<?php echo $SysValue['connect']['host'] ?>" name="host"></td>
                    </tr>
                    <tr>
                        <td align="right">Пользователь:</td>
                        <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly name="user_db" value="<?php echo $SysValue['connect']['user_db'] ?>"></td>
                    </tr>
                    <tr>
                        <td align="right">Пароль базы:</td>
                        <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly name="pass_db" value="<?php echo $SysValue['connect']['pass_db'] ?>"></td>
                    </tr>
                    <tr>
                        <td align="right">Имя базы:</td>
                        <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly name="dbase" value="<?php echo $SysValue['connect']['dbase'] ?>"></td>
                    </tr>
                    <tr>
                        <td align="right">Префикс:</td>
                        <td align="left"><input type="text" style="width:300" name="prefix" value="phpshop_" onchange="Warning()"></td>
                    </tr>
            </table>
            <br>
        </FIELDSET>
        <br>
        <FIELDSET id=fldLayout>
            <LEGEND id=lgdLayout >Доступные обновления ПО для версий:</LEGEND>
            <div style="padding:10px">
    <?php echo GetUpdate("123") ?><br><br>
                Выберете свою текущую версию ПО (до обновления).<br>
                Если вашей версии нет в списке то выберите версию выше и самую близкую от вашей (до обновления).<br><br>
                <b>Важно: сделать резервную копию базы перед запуском обновления.</b>
            </div>

        </FIELDSET>

    </div>
    <table cellpadding="0" cellspacing="0" width="100%" height="50" style="margin-top:60px">
        <tr>
            <td><hr></td>
        </tr>
        <tr>
            <td align="right" style="padding:10px">
                <INPUT class=but type=button value="&laquo; Назад" onclick="history.back(1)">
                <INPUT class=but type=button value="Отмена" onclick="window.close()">
                <INPUT class=but type="Submit" value="Далее &raquo;">
                <input type="hidden" name="install" value="2">
            </td>
        </tr>
    </form>
    </table>
    <?php
} else {
    $bases = null;
    while (list($val) = each($SysValue['base']))
        $bases.=$SysValue['base'][$val] . ", ";

    $bases = substr($bases, 0, strlen($bases) - 2);

    ?>

    <TABLE cellSpacing=1 cellPadding=5 width="100%" height="70%" align=center border=0>
        <FORM method="post" name="regForma">
            <TR class=adm vAlign=top align=middle>
                <TD width="100%" height="100%" align=left>
                    <FIELDSET style="height:100%"><LEGEND>Лицензионное соглашение</LEGEND>
                            <textarea style="width:99%;height:100%">
ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ НА ИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ПРОДУКТА "PHPShop"

Настоящее Лицензионное Соглашение заключается между пользователем программного продукта "PHPShop" (далее Пользователь) и ООО "ПХПШОП" (далее Автор). Перед использованием продукта внимательно ознакомьтесь с условиями данного соглашения. Если вы не согласны с условиями данного соглашения, вы не можете использовать данный продукт. Установка и использование продукта (в том числе просмотр исходного кода) означает ваше полное согласие со всеми пунктами настоящего соглашения. Соглашение относится ко всем коммерчески распространяемым версиям и модификациям программного продукта PHPShop.

Основные термины настоящего соглашения: ЭКЗЕМПЛЯР ПРОГРАММЫ - копия продукта "PHPShop", включающая в себя код программы Интернет-магазина, воспроизведенный в файлах, включая электронную или распечатанную документацию.

Лицензионное соглашение вступает в силу с момента приобретения или установки продукта и действует на протяжении всего срока использования продукта.

1. Предмет лицензионного соглашения
1.1. Предметом настоящего лицензионного соглашения является право использования одного экземпляра программного продукта (в дальнейшем "ЭКЗЕМПЛЯР ПРОГРАММЫ", "программа" или "продукт") "PHPShop", предоставляемое Пользователю ООО "ПХПШОП", в порядке и на условиях, установленных настоящим соглашением.
1.2. Все положения настоящего соглашения распространяются как на весь продукт в целом, так и на его отдельные компоненты.
1.3. Данное Соглашение дает право Пользователю на использование одной копии Продукта на одном web-сервере в пределах одного домена.
1.4. Лицензионное соглашение не предоставляет право собственности на продукт "PHPShop" и его компоненты, а только право использования ЭКЗЕМПЛЯРА ПРОГРАММЫ и его компонентов в соответствии с условиями, которые обозначены в пункте 3 настоящего соглашения.

2. Авторские права
2.1. Все авторские права на Продукт, включая документацию и исходный текст, принадлежат Автору, на основании свидетельств о государственной регистрации программы для ЭВМ "PHPShop" №2006614274 и №2010611237.
2.2. Продукт в целом или по отдельности является объектом авторского права и защищен Законом РФ "О правовой охране программ для электронных вычислительных машин и баз данных" от 23 сентября 1992 года, Законом РФ "Об авторском праве и смежных правах" от 9 июля 1993 года, а также международными Договорами.
2.3. В случае нарушения авторских прав предусматривается ответственность в соответствии с действующим законодательством РФ.

3. Условия использования продукта и ограничения
3.1. Пользователь имеет право бесплатно воспользоваться демо-версией Продукта, скачав с сайта Лицензиара www.phpshop.ru и установив на сервер в течении 30 дней, и без ограничений времени при установке на локальном компьютере. Демо-версии всех версий Продукта PHPShop работают без каких-либо ограничений функциональности, кроме количества выгрузки товаров в обработчике 1С версии PHPShop Enterprise Pro.
3.2. Для каждой новой установки Продукта на другой адрес web-сервера должна быть приобретена отдельная Лицензия. Перевод лицензии на новый домен возможен только при активной технической поддержке.
3.3. Автор оставляет за собой право требовать размещения обратной ссылки, с указанием Авторского права на сайте, где используется Продукт. Использование Продукта с нарушением условий данного Соглашения, является нарушением законов об авторском праве, и будет преследоваться в соответствии с действующим законодательством. Отказ от размещения обратной ссылки с указанием Авторского права является нарушением Соглашения и ограничивает Продукт в предоставлении технической поддержки Автором на все сайты Пользователя.
3.4. Вид ссылки и размещение строго задается Автором, код ссылки не поддается изменению. В целях сохранения визуализации с персональным дизайном возможно изменение цвета ссылки (задается лицензией).
3.5. Для официальных партнеров, после письменного согласования с Автором, ссылка размещается в удобном для них месте, на каждой странице сайта. Лицензия без копирайтов Автора увеличивает стоимость Продукта.
3.6. Версии Enterprise и EnterprisePro поддерживают размещение в некорневые директории, т.е. вида seamply.ru/market1/. Размещение типа market1.seamply.ru и т.д. требует покупки отдельной Лицензии. Техническая поддержка распространяется только на одну копию Продукта. Для каждого нового экземпляра магазина, а также для магазинов некорневых директорий вида seamply.ru/market1/, требуется покупка новой технической поддержки по тарифам, указанным на сайте Лицензиара. Версии Start и Catalog поддерживают размещение только в корневой папке или поддомене. Допускается возможность создания и использования Пользователем дополнительной копии Продукта исключительно в целях тестирования или внесения изменений в исходный код, при условии, что такая копия не будет доступна третьим лицам.
3.7. После покупки товара покупателю предоставляются исходные коды php-приложения за исключением файла index.php, в котором происходит проверка лицензии и защита от несанкционированного распространения программы. Все дополнительные приложения из комплекта EasyControl предоставляются в скомпилированном виде без возможности внесения изменения в код.
3.8. Пользователь может изменять, добавлять или удалять открытые файлы приобретенного ЭКЗЕМПЛЯРА ПРОГРАММЫ "PHPShop" в соответствии с Законодательством РФ об авторском праве. Изменение скомпилированных файлов запрещено и влечет нарушение данного Соглашения в соответствии с 273 статьей УК РФ.

4. Ответственность сторон
4.1. Пользователь не может копировать, передавать третьим лицам или распространять, сдавать в аренду/прокатПродукт и его компоненты, в том числе, созданные на базе Продукта сайты, в любой форме, в том числе, в виде исходного текста, каким-либо другим способом.
4.2. Любое распространение Продукта без предварительного согласия Автора, включая некоммерческое, является нарушением данного Соглашения, и влечет ответственность согласно действующему законодательству.
4.3. Продукт поставляется на условиях "КАК ЕСТЬ" ("AS IS") без предоставления гарантий производительности, покупательной способности, сохранности данных, а также иных явно выраженных или предполагаемых гарантий.
4.4. Автор не несет какой-либо ответственности за причинение или возможность причинения вреда Вам, Вашей информации или Вашему бизнесу вследствие использования или невозможности использования Продукта.
4.5. Автор не несет ответственность, связанную с привлечением Вас к административной или уголовной ответственности за использование Продукта в противозаконных целях (включая, но не ограничиваясь, продажей через Интернет магазин объектов, изъятых из оборота или добытых преступным путем, предназначенных для разжигания межрасовой или межнациональной вражды; и т.д.).
4.6. Автор не несет ответственности за работоспособность Продукта, в случае внесения Вами каких бы то ни было изменений в код программы.
4.7. Запрещается любое использование Продукта, противоречащее действующему законодательству РФ.
4.8. За нарушение условий настоящего соглашения наступает ответственность, предусмотренная законодательством РФ.

5. Условия технической поддержки
5.1. Приобретая Интернет-магазина PHPShop Enterprise, Пользователь получает бесплатную базовую техническую поддержку в течении 6 месяцев. Для версий PHPShop Start срок поддержки составляет 3 месяца.
5.2. Техническая поддержка предусматривает доступ к обновлениям, технические консультации, устранение ошибок в программном продукте "PHPShop", выявленных в течение гарантийного периода.
5.3. В поддержку включены консультации по поводу управления и заполнения магазина. Настройки связи с 1С (подключение к серверу и синхронизация данных). Вопросы по поводу установки продукта на сервер, решения проблем, мешающие установки продукта на сервер. Установка и настройка дополнительных бесплатных утилит из пакета EasyControl.
5.4. Консультации проводятся в специальном разделе сайта службы технической поддержки help.phpshop.ru ООО "ПХПШОП" в течение гарантийного срока по рабочим дням (за исключением выходных и нерабочих праздничных дней Российской Федерации) с 10 до 18 часов московского времени.
5.5. По истечению срока бесплатной технической поддержки, Пользователь может приобрести продление. Срок действия технической поддержки продлевается на один год с момента оплаты продления. Пользователь также получает возможность загрузить и установить все изменения и обновления, которые были выпущены к программному продукту до момента оплаты продления технической поддержки. Действующий прайс-лист для приобретения технической поддержки указан на интернет-сайте http://www.phpshop.ru/order/.
5.6. Проблемы, не относящиеся к базовой технической поддержке, не могут быть бесплатно решены. Для выявления и решения таких проблем следует оплатить дополнительные технические работы. Полный список платных технических работ доступен по ссылке: https://help.phpshop.ru/knowledgebase.php?article=116
5.7. Персональные доработки и модули, выполненные под заказ, поддерживаются бесплатно в течении 1 месяца.

6.Политика возврата денежных средств
6.1. В связи с тем, что перед приобретением, Автором предоставлено право проверить соответствие Продукта потребностям Пользователя, а именно, установить демо-версию Продукта, согласно п. 3.1. настоящего Соглашения, а также, по причине того, что Автор при продаже передает нематериальный продукт, не подлежащий возврату физически, возврат денежных средств Пользователю возможен, если Продукт явно не соответствует функциям, которые описаны в Руководстве Пользователя по адресу: http://wiki.phpshop.ru
6.2. Любые другие потребительские свойства, предполагаемые, но не обнаруженные пользователем при покупке, кроме описанных в http://wiki.phpshop.ru и на сайте Автора, не могут являться причиной для возврата денежных средств.
6.3. Возврат денежных средств осуществляется без комиссий банков и других платежей, по письменному заявлению Пользователя, не позднее 30 (тридцати) календарных дней с момента приобретения Продукта. В заявлении необходимо указать, что Пользователь гарантирует неиспользование Продукта, а также удаление всех без исключения полученных от Автора файлов, имеющих отношение к Продукту.
6.4. По истечении 30 (тридцати) дней с момента приобретения Продукта, претензии Автором не принимаются и денежные средства не возвращаются.
6.5. Возврат осуществляется в течение 15 (пятнадцати) календарных дней с момента получения письменного заявления в случае принятия Автором решения о возврате денежных средств Пользователю.
6.6. Бесплатные утилиты EasyControl, кроме платной синхронизации с 1С, предоставляются на условиях работы КАК ЕСТЬ" ("AS IS"), и не могут быть причиной возврата денежных средств за Продукт.

7. Изменение и расторжение соглашения
7.1. В случае невыполнения пользователем одного из вышеуказанных положений, ООО "ПХПШОП" имеет право в одностороннем порядке расторгнуть настоящее соглашение, уведомив об этом пользователя.
7.2. При расторжении соглашения Пользователь обязан прекратить использование продукта и удалить Лицензия полностью.
7.3. Пользователь вправе расторгнуть данное соглашение в любое время, полностью удалив ЭКЗЕМПЛЯР ПРОГРАММЫ "PHPShop", при этом, расторжение Соглашения не обязывает Автора возвращать средства, потраченные Пользователем на приобретение Продукта.
7.4. В случае если компетентный суд признает какие-либо положения настоящего соглашения недействительными, Соглашение продолжает действовать в остальной части.
7.5. Настоящее лицензионное соглашение также распространяется на все обновления, предоставляемые пользователю в рамках технической поддержки, если только при обновлении программного продукта пользователю не предлагается ознакомиться и принять новое лицензионное соглашение или дополнения к действующему соглашению. 

Контактная информация компании ООО «ПХПШОП»
Адрес сайта: http://www.phpshop.ru
E-mail отдела продаж: sales@phpshop.ru
Телефон отдела продаж: +7 (495) 989-11-15
Раздел техподдержки на сайте: https://help.phpshop.ru

                            </textarea>

                    </FIELDSET> </TD>
            </TR>
    </TABLE><br>
    &nbsp;&nbsp;<input type="checkbox" name="selectLic">Я принимаю условия лицензионного соглашения
    </DIV>
    <br>
    <hr>
    <table cellpadding="0" cellspacing="0" width="100%" height="50" >
        <tr>
            <td align="right" style="padding:10">
                <INPUT class=but type=button value="Отмена" onclick="window.close()">
                <INPUT class=but type="button" value="Далее &raquo;" onclick="ChekRegLic()">
                <input type="hidden" name="install" value="1">
            </td>
        </tr>
    </form>
    </table>
<?php } ?>


</body>
</html>