<?
// Парсируем установочный файл
$SysValue=parse_ini_file("../../phpshop/inc/config.ini",1);
$version=substr($SysValue['upload']['version'],1,1);

// Глобалс он
@extract($_GET);
@extract($_POST);
@extract($_FORM);
@extract($_FILES);
?>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<title><?= $SysValue['license']['product_name']?> -> Установка обновления</title>
<META http-equiv=Content-Type content="text/html; charset=windows-1251">
<META name="ROBOTS" content="NONE">
<LINK href="<?=$SysValue['dir']['dir']?>/phpshop/admpanel/css/texts.css" type=text/css rel=stylesheet>
<script>
    function Warning(){
        return alert("Внимание!\nНе забудте поменять префиксы баз данных в установочном файле config.ini");
    }

    function InstallOk(){
        window.opener.location.replace("/");
        window.close();
    }

    function Readonlys(){
        return alert("Внимание!\nДанные редактирируются только в файле config.ini");
    }

    function ChekRegLic(){
        var s1=window.document.forms.regForma.selectLic.checked;
        if(s1 == false){
            if(confirm("Внимание!\nВы  согласны с  лицензионным соглашением?"))
                window.document.forms.regForma.selectLic.checked = true;
        }
        else document.regForma.submit();
    }

</script>
</head>
<body bottommargin="0"  topmargin="0" leftmargin="0" rightmargin="0">
    <table cellpadding="0" cellspacing="0" width="100%" height="50" id="title">
        <tr bgcolor="#ffffff">
            <td style="padding:10">
                     <b>Обновление интернет-магазина <?= $SysValue['license']['product_name']." (сборка ". $SysValue['upload']['version'].")"?></b><br>
                &nbsp;&nbsp;&nbsp;Выбор параметров обновления.
            </td>
            <td align="right">
                <img src="<?=$SysValue['dir']['dir']?>/phpshop/admpanel/img/i_server_info_med[1].gif" border="0" hspace="10">
            </td>
        </tr>
    </table>
    <br>
    <?


// Выбор файла
    function GetFile($dir) {
        if ($dh = opendir($dir)) {
            while (($file = readdir($dh)) !== false) {
                $fstat = explode(".",$file);
                if($fstat[1] == "sql")
                    $fileBase=$file;
            }
            closedir($dh);
        }
        return "./".$dir."/".$fileBase;
    }

    function GetUpdate($skin) {
        global $SysValue;
        $dir="./";
        if (is_dir($dir)) {
            if ($dh = opendir($dir)) {
                while (($file = readdir($dh)) !== false) {

                    if($skin == $file)
                        $sel="selected";
                    else $sel="";

                    if($file!="." and $file!=".." and is_dir($file))
                        @$name.= "<option value=\"$file\" $sel>$file</option>";
                }
                closedir($dh);
            }
        }
        $disp="
<select name=\"update_dir\">
".@$name."
</select>
";
        return @$disp;
    }

// Устанавливаем базу
    if(@$install == 2) {


// Подключаем базу MySQL
        @mysql_connect ($SysValue['connect']['host'], $SysValue['connect']['user_db'],  $SysValue['connect']['pass_db']);
        mysql_select_db($SysValue['connect']['dbase']);
        @mysql_query("SET NAMES 'cp1251'");


        $fileBase=GetFile($update_dir);
        $lines=file($update_dir."/file.txt");
        @$fp = fopen($fileBase, "r");

        if ($fp) {
            stream_set_write_buffer($fp, 0);
            $fstat = fstat($fp);
            $CsvContent=fread($fp,$fstat['size']);
            $CsvContent=eregi_replace("phpshop_",$prefix,$CsvContent);
            fclose($fp);
        }
        $IdsArray2=split(";",$CsvContent);
        array_pop($IdsArray2);
        while (list($key, $val) = each($IdsArray2))
            $result=mysql_query($val);
        if(@$result) {
            $disp= "<h4>Обновление базы прошло успешно.</h4>
                    $fileInstr
                    ";
            foreach ($lines as $line_num => $line) {
                @$disp2.=htmlspecialchars($line) . "<br>\n";
            }
            $d="";
        }
        else {
            $disp="<h4>Ошибка установки: ".mysql_error()." </h4>";
            $d="disabled";
        }
        ?>
    <TABLE cellSpacing=0 cellPadding=0 width="100%"><TBODY>
            <TR>
                <TD vAlign=top>
                    <TABLE cellSpacing=1 cellPadding=5 width="50%" align=center border=0>
                        <FORM method=post>
                            <TBODY>
                                <TR class=adm vAlign=top align=middle>
                                    <TD align=left>
                                        <FIELDSET >
                                            <div align="center" style="padding:10;WIDTH: 545;">
                                                    <?=@$disp?>
                                            </div>
                                        </FIELDSET>
                                        <br>
                                        <FIELDSET id=fldLayout style="WIDTH: 545;">
                                            <LEGEND id=lgdLayout ><u>О</u>бновление файлов:</LEGEND>
                                            <div style="padding:10;WIDTH:100%;height:250px;overflow:auto">
                                                    <?=@$disp2?>
                                            </div>
                                        </FIELDSET>
                                    </TD>
                                </TR></FORM></TBODY></TABLE></TD></TR></TBODY></TABLE>
<table cellpadding="0" cellspacing="0" width="100%" height="50" style="margin-top:50">
    <tr>
        <td><hr></td>
    </tr>
    <tr>
        <td align="right" style="padding:10">
            <INPUT class=but type=button value="&laquo; Назад" onclick="history.back(1)">
            <INPUT class=but type=button id="close" value="Готово" onclick="InstallOk()" <?=$d?>>
        </td>
    </tr>
</form>
</table>
    <?
}

elseif(@$install==1) {
    ?>
<div style="padding:5">
    <FIELDSET id=fldLayout style="WIDTH: 545;">
        <LEGEND id=lgdLayout ><u>M</u>ySQL</LEGEND>
        <br>
        <table cellSpacing=1 cellPadding=5  border=0 width="100%">
            <FORM method="post" name="install">
                <tr>
                    <td align="right" width="100">Хост:</td>
                    <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly value="<?= $SysValue['connect']['host']?>" name="host"></td>
                </tr>
                <tr>
                    <td align="right">Пользователь:</td>
                    <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly name="user_db" value="<?= $SysValue['connect']['user_db']?>"></td>
                </tr>
                <tr>
                    <td align="right">Пароль базы:</td>
                    <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly name="pass_db" value="<?= $SysValue['connect']['pass_db']?>"></td>
                </tr>
                <tr>
                    <td align="right">Имя базы:</td>
                    <td align="left"><input type="text" style="width:300" onclick="Readonlys()" readonly name="dbase" value="<?= $SysValue['connect']['dbase']?>"></td>
                </tr>
                <tr>
                    <td align="right">Префикс:</td>
                    <td align="left"><input type="text" style="width:300" name="prefix" value="phpshop_" onchange="Warning()"></td>
                </tr>
        </table>
        <br>
    </FIELDSET>
    <br>
    <FIELDSET id=fldLayout style="WIDTH: 545;">
        <LEGEND id=lgdLayout ><u>Д</u>оступные обновления ПО для версий:</LEGEND>
        <div style="padding:10px">
                <? echo GetUpdate("123")?><br><br>
            Выберете свою текущую версию ПО.<br>
            Если вашей версии нет в списке, то воспользуйтесь инструкциями  в файле <a href="Update.txt" target="_blank">Update.txt</a> для ручного обновления базы MySQL.<br><br>
            <b>Важно: сделать резервную копию базы перед запуском обновления.</b>
        </div>

    </FIELDSET>

</div>
<table cellpadding="0" cellspacing="0" width="100%" height="50" style="margin-top:60">
    <tr>
        <td><hr></td>
    </tr>
    <tr>
        <td align="right" style="padding:10">
            <INPUT class=but type=button value="&laquo; Назад" onclick="history.back(1)">
            <INPUT class=but type=button value="Отмена" onclick="window.close()">
            <INPUT class=but type="Submit" value="Далее &raquo;">
            <input type="hidden" name="install" value="2">
        </td>
    </tr>
</form>
</table>


    <?
}
else {

    while (list($val) = each($SysValue['base']))
        @$bases.=$SysValue['base'][$val].", ";

    $bases=substr($bases,0,strlen($bases)-2);
    $bases2=ereg_replace("phpshop_system","",$bases);
    ?>

<TABLE cellSpacing=1 cellPadding=5 width="100%" align=center border=0>
    <FORM method="post" name="regForma">
        <TR class=adm vAlign=top align=middle>
            <TD width="100%" align=left>
                <FIELDSET id=fldLayout ><LEGEND id=lgdLayout><u>Л</u>ицензионное соглашение</LEGEND>
                    <DIV style="PADDING-RIGHT: 10px; PADDING-LEFT: 10px; PADDING-BOTTOM: 10px; PADDING-TOP: 10px">
                        <textarea style="width=99%;height:320px">
ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ НА ИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ПРОДУКТА «PHPSHOP»

Настоящее лицензионное соглашение заключается между пользователем программного продукта «PHPShop» (далее Пользователь) и ООО «ПХПШОП». Перед использованием продукта внимательно ознакомьтесь с условиями данного соглашения. Если вы не согласны с условиями данного соглашения, вы не можете использовать данный продукт. Установка и использование продукта означает ваше полное согласие со всеми пунктами настоящего соглашения. Соглашение относится ко всем коммерчески распространяемым версиям и модификациям программного продукта PHPShop.

Основные термины настоящего соглашения: ЭКЗЕМПЛЯР ПРОГРАММЫ - копия продукта «PHPShop», включающая в себя код программы Интернет-магазина, воспроизведенный в файлах или на бумаге, включая электронную или распечатанную документацию.

Лицензионное соглашение вступает в силу с момента приобретения или установки продукта и действует на протяжении всего срока использования продукта.

1.Предмет лицензионного соглашения
1.1.Предметом настоящего лицензионного соглашения является право использования одного экземпляра программного продукта (в дальнейшем «ЭКЗЕМПЛЯР ПРОГРАММЫ», «программа» или «продукт») «PHPShop», предоставляемое Пользователю ООО «ПХПШОП», в порядке и на условиях, установленных настоящим соглашением.

1.2.Все положения настоящего соглашения распространяются как на весь продукт в целом, так и на его отдельные компоненты.

1.3.Данное Соглашение дает право Пользователю на использование неограниченного количества копии Продукта на одном web-сервере в пределах
одного домена.

1.4.Лицензионное соглашение не предоставляет право собственности на продукт «PHPShop» и его компоненты, а только право использования ЭКЗЕМПЛЯРА ПРОГРАММЫ и его компонентов в соответствии с условиями, которые обозначены в пункте 3 настоящего соглашения.

2.Авторские права
2.1. Все авторские права на Продукт, включая документацию и исходный текст  принадлежат Автору, на основании свидетельства о государственной регистрации программы для ЭВМ "PHPShop" № 2006614274. OOO «ПХПШОП» имеет исключительное право на продажу для ЭВМ "PHPShop", регламентированное лицензионным договором о передаче исключительных права на продажу между Автором и ООО «ПХПШОП».

2.2. Продукт в целом или по отдельности является объектом авторского права и защищен Положениями части четвертой ГК РФ.

2.3. В случае нарушения авторских прав предусматривается ответственность в соответствии с действующим законодательством РФ.

3.Условия использования продукта и ограничения
3.1.Пользователь имеет право бесплатно воспользоваться демо-версией Продукта, скачав с сайта Лицензиара http://www.phpshop.ru и установив на сервер в течении 45 дней, и без ограничений времени при установке на локальном компьютере. Демо-версии всех версий Продукта PHPShop работают без каких-либо ограничений функциональности, кроме количества выгрузки товаров в обработчике 1С версии PHPShop Enterprise Pro.

3.2.Пользователь имеет право на использование неограниченного количества копий Продукта на одном web-сервере в пределах одного домена. Перевод лицензии на новый домен возможен только при активной технической поддержке.
3.3.Для каждой новой установки Продукта на другой адрес web-сервера должна быть приобретена отдельная Лицензия.

3.4.Автор оставляет за собой право требовать размещения обратной ссылки с указанием Авторского права на сайте, где используется Продукт. Использование Продукта с нарушением условий данного Соглашения, является нарушением законов об авторском праве, и будет преследоваться в соответствии с действующим законодательством. Отказ от размещения обратной ссылки с указанием Авторского права является нарушением Соглашения и ограничивает Продукт в предоставлении технической поддержки Автором.

3.5.Вид ссылки и размещение строго задается Автором, код ссылки не поддается изменению. В целях сохранения визуализации с персональным дизайном возможно изменение цвета ссылки (задается лицензией).

3.6.Для официальных партнеров возможна выписка лицензии без копирайтов Автора. Ссылка в таком случае размещается в согласовании с Автором партнерами в удобной для них месте каждой страницы сайта. Лицензия без копирайтов автора обговаривается отдельно, стоимость такой лицензии назначается персонально.

3.7.Версии Enterprise и Enterprise Pro поддерживают размещение в некорневые директории, т.е. вида seamply.ru/market1/. Размещение типа market1.seamply.ru и т.д. требует покупки отдельной Лицензии. Техническая поддержка распространяется только на одну копию Продукта. Для каждого нового экземпляра магазина, а также для магазинов некорневых директорий вида seamply.ru/market1/, требуется покупка новой технической поддержки по тарифам, указанным на сайте Лицензиара.

3.8.Версии Start и Catalog, Catalog Pro поддерживают размещение только в корневой папке или поддомене. Допускается возможность создания и использования Пользователем дополнительной копии Продукта исключительно в целях тестирования или внесения изменений в исходный код, при условии, что такая копия не будет доступна третьим лицам.

3.9.Пользователь не может копировать программу, передавать ее третьим лицам или распространять программу и ее компоненты, а также созданные на базе программы сайты, в любой форме, в том числе в виде исходного текста, каким-либо способом, в том числе сдавать в аренду/прокат программу и ее компоненты, а также созданные на ее базе  сайты.

3.10.Пользователь может изменять, добавлять или удалять любые файлы приобретенного ЭКЗЕМПЛЯРА ПРОГРАММЫ «PHPShop» в соответствии с Законодательством РФ об авторском праве.

3.11.Запрещается любое использование Продукта, противоречащее действующему законодательству РФ.

4.Ответственность сторон
4.1.Любое распространение Продукта без предварительного согласия Автора, включая некоммерческое, является нарушением данного Соглашения и влечет ответственность согласно действующему законодательству.

4.2.За нарушение условий настоящего соглашения наступает ответственность, предусмотренная законодательством РФ.

4.3.Продукт поставляется на условиях "КАК ЕСТЬ" ("AS IS") без предоставления гарантий производительности, покупательной способности, сохранности данных, а также иных явно выраженных или предполагаемых гарантий. Автор не несет какой-либо ответственности за причинение или возможность причинения вреда Вам, Вашей информации или Вашему бизнесу вследствие использования или невозможности использования Продукта.

4.4.Автор не несет ответственность, связанную с привлечением Вас к административной или уголовной ответственности за использование Продукта в противозаконных целях (включая, но не ограничиваясь, продажей через Интернет магазин объектов, изъятых из оборота или добытых преступным путем, предназначенных для разжигания межрасовой или межнациональной вражды; и т.д.).

4.5.Автор не несет ответственности за работоспособность Продукта в случае внесения Вами каких бы то ни было изменений.

5.Условия технической поддержки
5.1.Приобретая Интернет-магазина PHPShop Enterprise, Пользователь получает бесплатную базовую техническую поддержку в течении 6 месяцев. Для версий PHPShop Start и PHPShop Catalog срок поддержки составляет 3 месяца.

5.2.Техническая поддержка предусматривает доступ к обновлениям, технические консультации,  устранение ошибок в программном продукте «PHPShop», выявленных в течение гарантийного периода.

5.3.Консультации проводятся в специальном разделе сайта службы технической поддержки www.help.phpshop.ru ООО «ПХПШОП» в течение гарантийного срока по рабочим дням (за исключением выходных и нерабочих праздничных дней Российской Федерации) с 10 до 18 часов московского времени.

5.4.По истечению срока бесплатной технической поддержки, Пользователь может приобрести продление. Срок действия технической поддержки продлевается на один год с момента оплаты продления. Пользователь также получает возможность загрузить и установить все изменения и обновления, которые были выпущены к программному продукту до момента оплаты продления технической поддержки. Действующий прайс-лист для приобретения технической поддержки указан на интернет-сайте http://www.phpshop.ru.

6.Изменение и расторжение соглашения
6.1.В случае невыполнения пользователем одного из вышеуказанных положений, ООО «ПХПШОП» имеет право в одностороннем порядке расторгнуть настоящее соглашение, уведомив об этом пользователя.

6.2.При расторжении соглашения Пользователь обязан прекратить использование продукта и удалить Лицензия полностью.

6.3.Пользователь вправе расторгнуть данное соглашение в любое время, полностью удалив ЭКЗЕМПЛЯР ПРОГРАММЫ «PHPShop», при этом, расторжение Соглашения не обязывает Автора возвращать средства, потраченные Пользователем на приобретение Продукта, согласно ст. 25, п. 1.4 Закона РФ от 7 февраля 1992 г. N 2300-I «О защите прав потребителей» и п.14 «Перечня непродовольственных товаров надлежащего качества, не подлежащих возврату или обмену», утвержденном Постановлением Правительства РФ от 19.01.1998 № 55.

6.4.В случае если компетентный суд признает какие-либо положения настоящего соглашения недействительными, Соглашение продолжает действовать в остальной части.
Настоящее лицензионное соглашение также распространяется на все обновления, предоставляемые пользователю в рамках технической поддержки, если только при обновлении программного продукта пользователю не предлагается ознакомиться и принять новое лицензионное соглашение или дополнения к действующему соглашению.


Контактная информация компании ООО «ПХПШОП»
Адрес сайта: http://www.phpshop.ru
E-mail отдела продаж: sales@phpshop.ru
Телефон отдела продаж: +7 (495) 989-11-15
Раздел техподдержки на сайте: https://help.phpshop.ru
E-mail администрации: mail@phpshop.ru</textarea>

                </FIELDSET> </TD>
        </TR>
</TABLE><br>
&nbsp;&nbsp;<input type="checkbox" name="selectLic">Я принимаю условия лицензионного соглашения
</DIV>
<br>
<hr>
<table cellpadding="0" cellspacing="0" width="100%" height="50" >
    <tr>
        <td align="right" style="padding:10">
            <INPUT class=but type=button value="Отмена" onclick="window.close()">
            <INPUT class=but type="button" value="Далее &raquo;" onclick="ChekRegLic()">
            <input type="hidden" name="install" value="1">
        </td>
    </tr>
</form>
</table>
    <?}?>


</body>
</html>
