<h1 class="HTitle4">Ошибка оплаты</h1>

<p></p>

<div>
<b>Возможные причины:</b>
<ol> 
    <li>Ошибка в платежном шлюзе.
	<li>Ссылка набрана неправильно.
	<li>Отказ от оплаты заказа.
	<li>Заказа с таким номером не существует.
</ol>
<b>Что делать:</b>
<ol>
	<li>Проверьте, правильно ли набран адрес.
	<li>Обратитесь к <img src="images/icon_email.gif" alt="" width="16" height="16" border="0" align="absmiddle" hspace="3"><a href="mailto:@adminMail@>?subject=Ошибка оплаты заказа №@orderNum@ через платежную систему">администратору</a>.
</ol>
</div>