<?php

function tab_showcase() {
    global $PHPShopGUI;
    return $PHPShopGUI->setInfo('
     <p>ƒополнительна€ витрина позвол€ет выводить заданные категории товаров на дополнительных адресах с персональными настройками отображени€ дизайна, страниц и текстовых блоков без повторной установки платформы и без покупки новой лицензию по полной стоимости (стоимость лицензии дл€ дополнительной витрины значительно меньше). ¬се остальные настройки магазина €вл€ютс€ общие и прив€заны к единой базе данных. ¬се заказы и пользователи поступают в единую панель управлени€. Ћицензи€ приобретаетс€ на максимальное количество дополнительных витрин, адреса витрин управл€ютс€ в карточке редактировани€ витрины и могут мен€тьс€ по вашему усмотрению в любое врем€. 
     </p>
     <h4>Ётапы создани€ витрины</h4>
     <ol>
     <li>ѕриобрести <a href="http://www.phpshop.ru/order/#showcase" target="_blank" class="btn btn-xs btn-default "><span class="glyphicon glyphicon-shopping-cart"></span> отдельную лицензию</a> на дополнительную витрину или лицензию на безлимитное количество витрин.
     <li>—оздать новый <kbd>јлиас</kbd> (синоним адреса сайта ) через панель управлени€ хостингом.
     <li>ƒобавить новую витрину с точным новым адресом алиаса в поле "јдрес".
     <li>¬ыбрать по желанию персональный дизайн витрины.
     <li>¬ыбрать категории товаров дл€ показа на витрине в закладке <kbd>ѕрава</kbd>.
     </ol>
     <p>ѕри изменении параметров лицензии (продление техподдержки и т.д.) или доступа к базе данных, требуетс€ обновление защищенной подписи витрины через кнопку <span class="btn btn-xs btn-default "><span class="glyphicon glyphicon-ok"></span> —охранить и закрыть</span> в карточке редактировани€ витрины.</p>
');
}

?>