<div class="page-header not-center">
    <h1>{Ошибка оплаты}</h1>
</div>
<div>
    <b>{Возможные причины}:</b>
    <ol> 
        <li>{Ошибка в платежном шлюзе}.
        <li>{Ссылка набрана неправильно}.
        <li>{Отказ от оплаты заказа}.
        <li>{Заказа с таким номером не существует}.
    </ol>
    <b>{Что делать}:</b>
    <ol>
        <li>{Проверьте, правильно ли набран адрес}.
        <li>{Обратитесь к} <a href="mailto:@adminMail@?subject=Ошибка оплаты заказа №@orderNum@ через платежную систему">{администратору}</a>.
    </ol>
</div>