<P> <strong> ліцэнзійнае пагадненне НА ПРАГРАМНАЕ прадукту "PHPShop" </strong> </p>

<P> Сапраўднае Ліцэнзійная дамова заключаецца паміж карыстальнікам праграмнага прадукта "PHPShop" (далей Карыстальнік) і
    ОП Туренко Д. Л. (далей Аўтар). Перад выкарыстаннем прадукту уважліва азнаёмцеся з умовамі дадзенага пагаднення.
    Калі вы не згодныя з умовамі дадзенага пагаднення, вы не можаце выкарыстоўваць дадзены прадукт.
    Ўстаноўка і выкарыстанне прадукту (у тым ліку прагляд зыходнага кода) азначае ваша поўнае згоду з усімі пунктамі
    гэтага пагаднення. Пагадненне датычыцца ўсіх камерцыйна распаўсюджваюцца версіях і мадыфікацыям праграмнага прадукту PHPShop.
</P>
<P> Асноўныя тэрміны гэтай здзелкі: асобнікаў праграмы - копія прадукту "PHPShop", які ўключае ў сябе код праграмы Інтэрнэт-крамы,
    прайграны ў файлах, уключаючы электронную або раздрукаваную дакументацыю. </P>
<P> Ліцэнзійная дамова ўступае ў сілу з моманту набыцця або ўстаноўкі прадукту і дзейнічае на працягу ўсяго тэрміну выкарыстання прадукта. </P>
<P> <b> 1. Прадмет ліцэнзійнага пагаднення </b>
    <br> 1.1. Прадметам гэтага ліцэнзійнага пагаднення з'яўляецца права выкарыстання аднаго асобніка праграмнага прадукту
    (у далейшым "асобнікаў праграмы", "праграма" або "прадукт") "PHPShop", якая прадастаўляецца Карыстачу Аўтарам,
    у парадку і на ўмовах, устаноўленых гэтым пагадненнем.
    <br> 1.2. Усе палажэнні гэтага пагаднення распаўсюджваюцца як на ўвесь прадукт у цэлым, так і на яго асобныя кампаненты.
    <br> 1.3. Гэта Пагадненне дае права Карыстачу на выкарыстанне адной копіі Прадукту на адным web-сэрвэры ў межах аднаго дамена.
    <br> 1.4. Ліцэнзійнае пагадненне не дае права ўласнасці на прадукт "PHPShop" і яго кампаненты, а толькі права
    выкарыстання асобніка праграмы і яго кампанентаў у адпаведнасці з умовамі, якія пазначаныя ў пункце 3 гэтага пагаднення.
<P> <b> 2. Аўтарскія правы </b>
    <br> 2.1. Усе аўтарскія правы на Прадукт, уключаючы дакументацыю і зыходны тэкст, належаць Аўтару, на падставе
    сведчанняў аб дзяржаўнай рэгістрацыі праграмы для ЭВМ "PHPShop" №2006614274.
    <br> 2.2. Прадукт у цэлым або асобна з'яўляецца аб'ектам аўтарскага права і абаронены Законам РФ "Аб прававой ахове
    праграм для электронных вылічальных машын і баз даных" ад 23 верасня 1992 года, Законам РФ "Аб аўтарскім праве і сумежных правах"
    ад 9 ліпеня 1993 года, а таксама міжнароднымі дамовамі.
    <br> 2.3. У выпадку парушэння аўтарскіх правоў прадугледжваецца адказнасць у адпаведнасці з дзеючым заканадаўствам РФ.
<P> <b> 3. Умовы выкарыстання прадукту і абмежаванні </b>
    <BR> 3.1. Карыстальнік мае права бясплатна скарыстацца дэма-версіяй Прадукту, запампаваўшы з сайта ліцэнзіярам
    www.phpshop.ru і усталяваўшы на сервер на працягу 30 дзён, без абмежаванняў часу пры ўсталёўцы на лакальным кампутары.
    Дэма-версіі ўсіх версій Прадукту PHPShop працуюць без якіх-небудзь абмежаванняў функцыянальнасці, акрамя колькасці выгрузкі
    тавараў у апрацоўшчыку 1С версіі PHPShop Pro 1C.
    <br> 3.2. Для кожнай новай устаноўкі Прадукту на іншы адрас web-сервера павінна быць набыта асобная Ліцэнзія.
    Пераклад ліцэнзіі на новы дамен магчымы толькі пры актыўнай тэхнічнай падтрымкі.
    <br> 3.3. Аўтар пакідае за сабой права патрабаваць размяшчэння зваротнай спасылкі, з указаннем Аўтарскага правы на
    сайце, дзе выкарыстоўваецца Прадукт. Выкарыстанне Прадукту з парушэннем умоў гэтага Пагаднення, з'яўляецца парушэннем
    законаў аб аўтарскім праве, і будзе пераследвацца ў адпаведнасці з дзеючым заканадаўствам. Адмова ад размяшчэння зваротнай
    спасылкі з указаннем Аўтарскага права з'яўляецца парушэннем Пагаднення і абмяжоўвае Прадукт ў аказанні тэхнічнай падтрымкі
    Аўтарам на ўсе сайты карыстальніка.
    <br> 3.4. Выгляд спасылкі і размяшчэння строга задаецца Аўтарам, код спасылкі не паддаецца змене. З мэтай захавання
    візуалізацыі з персанальным дызайнам магчыма змяненне колеру спасылкі (задаецца ліцэнзіяй).
    <br> 3.5. Для афіцыйных партнёраў, пасля пісьмовага ўзгаднення з Аўтарам, спасылка размяшчаецца ў зручным для іх месцы,
    на кожнай старонцы сайта. Ліцэнзія без капірайтаў Аўтара павялічвае кошт Прадукту.

    <br> 3.6. Падтрымліваецца размяшчэння ў некорневые тэчкі, то ёсць выгляду seamply.ru/market1/. Тыпу market1.seamply.ru
    і г.д. патрабуе куплі асобнай ліцэнзіі. Тэхнічная падтрымка распаўсюджваецца толькі на адну копію Прадукту.
    Для кожнага новага асобніка крамы, а таксама для магазінаў некорневых дырэкторый выгляду seamply.ru/market1/,
    трэба купля новай тэхнічнай падтрымкі па тарыфах, пазначаных на сайце ліцэнзіярам. Дапускаецца магчымасць стварэння
    і выкарыстання Карыстальнікам дадатковай копіі Прадукту выключна ў мэтах тэставання або ўнясення змяненняў у зыходны
    код, пры ўмове, што такая копія не будзе даступная трэцім асобам.
    <br> 3.7. Пасля куплі тавару пакупніку прадастаўляюцца зыходныя коды php-прыкладання за выключэннем файла index.php,
    у якім адбываецца праверка ліцэнзіі і абарону ад несанкцыянаванага распаўсюджвання праграмы.
    Усе дадатковыя прыкладання з камплекты EasyControl падаюцца ў скампіляваных выглядзе без магчымасці ўнясення змены ў код.

    <br> 3.8. Карыстальнік можа змяняць, дадаваць або выдаляць адкрытыя файлы набытага экзэмпляра праграмы "PHPShop"
    у адпаведнасці з заканадаўствам РФ аб аўтарскім праве. Змена скампіляваных файлаў забаронена і цягне парушэнне
    дадзенага Пагаднення ў адпаведнасці з 273 артыкулам КК РФ.

<P> <b> 4. Адказнасць бакоў </b>
    <br> 4.1. Карыстальнік не можа капіяваць, перадаваць трэцім асобам або распаўсюджваць, здаваць у арэнду / прокатПродукт
    і яго кампаненты, у тым ліку, створаныя на базе Прадукту сайты, у любой форме, у тым ліку, у выглядзе зыходнага тэксту,
    любым іншым спосабам .

    <br> 4.2. Любое распаўсюджванне Прадукту без папярэдняй згоды Аўтара, уключаючы некамерцыйнае, з'яўляецца парушэннем гэтага Пагаднення, і цягне за сабой адказнасць згодна з дзеючым заканадаўствам.

    <br> 4.3. Прадукт пастаўляецца на ўмовах "ЯК ЁСЦЬ" ( "AS IS") без прадастаўлення гарантый прадукцыйнасці, пакупніцкай здольнасці, захаванасці дадзеных, а таксама іншых відавочна выяўленых або пэўныя гарантый.

    <br> 4.4. Аўтар не нясе ніякай адказнасці за прычыненне або магчымасць нанясення шкоды Вам, Вашай інфармацыі або Вашаму бізнэсу з прычыны выкарыстання або немагчымасці выкарыстання Прадукту.

    <br> 4.5. Аўтар не нясе адказнасць, звязаную з прыцягненнем Вас да адміністрацыйнай або крымінальнай адказнасці за выкарыстанне Прадукту ў супрацьзаконных мэтах (уключаючы, але не абмяжоўваючыся, продажам праз Інтэрнэт крама аб'ектаў, канфіскаваных з абароту або здабытых злачынным шляхам, прызначаных для распальвання міжрасавай або міжнацыянальнай варожасці, і г.д.).
    <br> 4.6. Аўтар не нясе адказнасці за працаздольнасць Прадукту ў выпадку ўнясення Вамі якіх бы там ні было змяненняў у код праграмы.
    <br> 4.7. Забараняецца любое выкарыстанне Прадукту, што супярэчыць дзеючаму заканадаўству РФ.
    <br> 4.8. За парушэнне ўмоў гэтага пагаднення надыходзіць адказнасць, прадугледжаная заканадаўствам РФ.
<P> <b> 5. Умовы тэхнічнай падтрымкі </b>

    <br> 5.1. Купляючы Інтэрнэт-крамы PHPShop Enterprise або PHPShop Pro 1C, Карыстальнік атрымлівае бясплатную базавую тэхнічную падтрымку на працягу 6 месяцаў. Для версій PHPShop Basic тэрмін падтрымкі складае 3 месяцы.

    <br> 5.2. Тэхнічная падтрымка прадугледжвае доступ да абнаўленняў, тэхнічныя кансультацыі, ўхіленне памылак у праграмным прадукце "PHPShop", выяўленых на працягу гарантыйнага перыяду.

    <br> 5.3. У падтрымку ўключаны кансультацыі з нагоды кіравання і запаўнення крамы. Настройка сувязі з 1С (падлучэнне да сервера і сінхранізацыя дадзеных). Пытанне з нагоды ўстаноўкі прадукту на сервер, рашэнне праблем, якія замінаюць ўстаноўкі прадукту на сервер. Ўстаноўка і настройка дадатковых бясплатных утыліт з пакета EasyControl.

    <br> 5.4. Кансультацыі праводзяцца ў спецыяльным раздзеле сайта тэхнічнай падтрымкі <a target="_blank" href="https://help.phpshop.ru/"> help.phpshop.ru </a> працягу гарантыйнага тэрміну у працоўныя дні (за выключэннем выхадных і непрацоўных святочных дзён Расійскай Федэрацыі) з 10 да 18 гадзін па маскоўскім часе.

    <br> 5.5. Па заканчэнні тэрміну бясплатнай тэхнічнай падтрымкі, Карыстальнік можа набыць працяг. Тэрмін дзеяння тэхнічнай падтрымкі падаўжаецца на адзін год з моманту аплаты працяг. Карыстальнік таксама атрымлівае магчымасць загрузіць і ўсталяваць ўсе змены і абнаўлення, якія былі выпушчаныя да праграмнага прадукту да моманту аплаты падаўжэння тэхнічнай падтрымкі. Дзеючы прайс-ліст для атрымання тэхнічнай падтрымкі паказана на інтэрнэт-сайце <a target="_blank" href="http://www.phpshop.ru/docs/techpod.html"> phpshop.ru/docs/techpod.html </a>.
        <br> 5.6. Праблемы, якія не адносяцца да базавай тэхнічнай падтрымкі, не могуць быць бясплатна вырашаны. Для выяўлення і вырашэння такіх праблем варта аплаціць дадатковыя тэхнічныя працы. Поўны спіс платных тэхнічных работ даступны па спасылцы: <a target="_blank" href="https://help.phpshop.ru/knowledgebase/article/116"> help.phpshop.ru/knowledgebase/article/116</a>
        <br> 5.7. Персанальныя дапрацоўкі і модулі, выкананыя на заказ, падтрымліваюцца бясплатна на працягу 1 месяца. </a>.
<P> <b> 6. Палітыка вяртання сродкаў </b>
    <br> 6.1. У сувязі з тым, што перад набыццём, аўтарам прадастаўлена права праверыць адпаведнасць Прадукту патрэбам карыстальніка, а менавіта, ўсталяваць дэма-версію Прадукту, згодна з п. 3.1. Пагаднення, а таксама ў сувязі з тым, што Аўтар пры продажы перадае нематэрыяльны прадукт, не падлягае вяртанню фізічна, вяртанне грашовых сродкаў Карыстачу магчымы, калі Прадукт відавочна не адпавядае функцыям, якія апісаны ў Кіраўніцтве карыстальніка па адрасе: <a target = "_ blank" href = "http://faq.phpshop.ru"> faq.phpshop.ru </a>
    <br> 6.2. Любыя іншыя спажывецкія ўласцівасці, меркаваныя, але не выяўленыя карыстальнікам пры куплі, акрамя апісаных у <a target="_blank" href="http://faq.phpshop.ru"> faq.phpshop.ru </a> і на сайце аўтара, не могуць быць прычынай для вяртання грашовых сродкаў.
    <br> 6.3. Вяртанне грашовых сродкаў ажыццяўляецца без камісій банкаў і іншых плацяжоў, па пісьмовай заяве Карыстальніка, не пазней за 30 (трыццаці) каляндарных дзён з моманту набыцця Прадукту. У заяве неабходна ўказаць, што Карыстальнік гарантуе невыкарыстанне Прадукту, а таксама выдалення ўсіх без выключэння атрыманых ад Аўтара файлаў, якія маюць дачыненне да прадукту.
    <br> 6.4. Па заканчэнні 30 (трыццаці) дзён з моманту набыцця Прадукту, прэтэнзіі Аўтарам не прымаюцца грашовыя сродкі не вяртаюцца.
    <br> 6.5. Вяртанне ажыццяўляецца на працягу 15 (пятнаццаці) каляндарных дзён з моманту атрымання пісьмовай заявы ў выпадку прыняцця Аўтарам рашэння аб вяртанні грашовых сродкаў Карыстачу.
    <br> 6.6. Бясплатныя ўтыліты EasyControl, акрамя платнай сінхранізацыі з 1С, прадастаўляюцца на ўмовах працы ЯК ЁСЦЬ "(" AS IS "), і не могуць быць прычынай вяртання грашовых сродкаў за Прадукт.

<P> <b> 7. Змена і скасаванне дамовы </b>
    <br> 7.1. У выпадку невыканання карыстальнікам аднаго з вышэйзгаданых палажэнняў, Аўтар мае права ў аднабаковым парадку скасаваць гэтае пагадненне, паведаміўшы пра гэта карыстальніка.
    <br> 7.2. Пры скасаванні дамовы Карыстальнік абавязаны спыніць выкарыстанне прадукту і выдаліць Ліцэнзія цалкам.
    <br> 7.3. Карыстальнік мае права скасаваць гэта пагадненне ў любы час, цалкам выдаліўшы асобнікаў праграмы "PHPShop", пры гэтым, скасавання Пагаднення не абавязвае Аўтара вяртаць сродкі, выдаткаваныя Карыстальнікам на набыццё Прадукту.
    <br> 7.4. У выпадку, калі кампетэнтны суд прызнае якія-небудзь палажэнні гэтага пагаднення несапраўднымі, Пагадненне працягвае дзейнічаць у іншай частцы.
    <br> 7.5. Цяперашні ліцэнзійнае пагадненне таксама распаўсюджваецца на ўсе абнаўлення, якія прапануюцца карыстальніку ў рамках тэхнічнай падтрымкі, калі толькі пры абнаўленні праграмнага прадукту карыстачу не прапануецца азнаёміцца ??і прыняць новае ліцэнзійнае пагадненне або дадатак да дзеючага пагаднення.
</ P>

<P>
    <Strong> Кантактная інфармацыя </strong> <br>

    Адрас сайта: <a href="http://www.phpshop.ru" target="_blank"> www.phpshop.ru </a> <br>
    Падручнік: <a href="http://faq.phpshop.ru" target="_blank"> faq.phpshop.ru </a> <br>
    Тэлефон: +7 (495) 989-11-15 <br>
    Тэхнічная падтрымка: <a href="https://help.phpshop.ru" target="_blank"> help.phpshop.ru </a> <br> <br>
    <Input type = "checkbox" checked disabled> Я прымаю ўмовы ліцэнзійнай дамовы.
</P>