<?php

function tab_info($data) {
    global $PHPShopGUI;
    
    $Info = '<p>
      <h4>Предоставить менеджеру Авито ссылку на XML файл:</h4>
        <ol>
            <li>
                Бытовая электроника: <code>http://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/phpshop/modules/avito/xml/appliances.php</code>   
            </li> 
            <li>
                Для дома и дачи: <code>http://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/phpshop/modules/avito/xml/home.php</code>   
            </li> 
        </ol>
        <h4>Настройка модуля</h4>
        <ol>
       <li>Поле пароль <b>защищает</b> от несанкционированной кражи контента. При использовании пароля ссылка на файл XML примет вид <code>http://' . $_SERVER['SERVER_NAME'] . '/phpshop/modules/avito/xml/файл.php?pas=*******</code>. При использовании пароля требуется так же заменить ссылку у менеджера Авито.
</li> </ol>
      <h4>Настройка категории</h4>
        <ol>
        <li>В категории открыть вкладку <kbd>Авито</kbd> настроить параметры вывода категории в Авито.</li>
        <li>"Категория товара" - выбрать, какой категории в Авито соответствует категория в интернет-магазине.</li>
        <li>Настроить опцию "Тип товара".</li>
        </ol>
      <h4>Настройка товара</h4>
        <ol>
        <li>В карточке редактирования товара в закладке <kbd>Авито</kbd> настроить дополнительные параметры вывода для Авито.</li>
        <li>Включить опцию "Включить экспорт в Авито".</li>
        <li>Заполнить поле "Название товара", если не заполнено - будет использоваться название товара.</li>
        <li>Настроить опцию "Состояние товара".</li>
        <li>Настроить опцию "Вариант платного размещения".</li>
        <li>Настроить опцию "Платная услуга".</li>
        </ol>
        </p>';
    
    return $PHPShopGUI->setInfo($Info, 280, '98%');
}
?>
