<?php
session_start();
require("../connect.php");
@mysql_connect("$host", "$user_db", "$pass_db") or @die("Невозможно подсоединиться к базе");
mysql_select_db("$dbase") or @die("Невозможно подсоединиться к базе");
require("../enter_to_admin.php");

// Выбор файла
function GetFile($dir) {
    if (@$dh = opendir($dir)) {
        while (($file = readdir($dh)) !== false) {
            $fstat = explode(".", $file);
            if ($fstat[1] == "lic")
                return 'license/' . $file;
        }
        closedir($dh);
    }
}

// Срок действия тех. поддержки
$GetFile = GetFile("../../../license/");
@$License = parse_ini_file("../../../" . $GetFile, 1);

$TechPodUntilUnixTime = $License['License']['SupportExpires'];
if (is_numeric($TechPodUntilUnixTime))
    $TechPodUntil = dataV($TechPodUntilUnixTime);
else
    $TechPodUntil = " - ";

$DomenLocked = $License['License']['DomenLocked'];
if (empty($DomenLocked))
    $DomenLocked = $_SERVER['SERVER_NAME'];


$LicenseUntilUnixTime = $License['License']['Expires'];
if (is_numeric($LicenseUntilUnixTime))
    $LicenseUntil = dataV($LicenseUntilUnixTime);
else
    $LicenseUntil = " - ";
?>
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
    <head>
        <title>О Программе</title>
        <META http-equiv=Content-Type content="text/html; charset=windows-1251">
        <LINK href="../skins/<?= $_SESSION['theme'] ?>/texts.css" type=text/css rel=stylesheet>
        <script language="JavaScript1.2" src="../java/javaMG.js" type="text/javascript"></script>
    </head>
    <body bottommargin="0" topmargin="0" leftmargin="0" rightmargin="0">

        <table cellpadding="0" cellspacing="0" width="100%" height="50" id="title">
            <tr bgcolor="#ffffff">
                <td style="padding:10">
                    <b><span name=txtLang id=txtLang>О программе</span> <?= $ProductName ?></b><br>
                    &nbsp;&nbsp;&nbsp;<span name=txtLang id=txtLang>Техническая поддержка и лицензионное соглашение</span>.
                </td>
                <td align="right">
                    <img src="../img/i_addremove_med[1].gif" border="0" hspace="10">
                </td>
            </tr>
        </table>
        <table cellSpacing=0 cellPadding=0 width="100%">
            <tr>
                <td>

                    <TABLE cellSpacing=0 cellPadding=0 width="100%">
                        <TR>
                            <TD vAlign=top  width="200">
                                <table width="100%" cellpadding="5" cellspacing="1" height="100%">
                                    <tr>
                                        <td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Название</span></td>
                                        <td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Версия</span></td>
                                    </tr>
                                    <tr bgcolor="#ffffff">
                                        <td><?= $ProductNameTM; ?></td>
                                        <td>
                                            <?= $SysValue['upload']['version']; ?>
                                        </td>
                                    </tr>
                                    <tr>
                                        <td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Поддержка</span></td>
                                        <td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Дата</span></td>
                                    </tr>
                                    <tr bgcolor="#ffffff">
                                        <td><span name=txtLang id=txtLang>Окончание</span></td>
                                        <td>
                                            <?= $TechPodUntil; ?>
                                        </td>
                                    </tr>
                                    <tr>
                                        <td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Лицензия</span></td>
                                        <td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Дата</span></td>
                                    </tr>
                                    <tr bgcolor="#ffffff">
                                        <td><span name=txtLang id=txtLang>Окончание</span></td>
                                        <td>
                                            <?= $LicenseUntil; ?>
                                        </td>
                                    </tr>
                                </table>
<form method="post" target="_blank" enctype="multipart/form-data" action="http://www.phpshop.ru/order.html" name="product_upgrade" id="product_support" style="display:none">
<input type="hidden" value="supportenterprise" name="addToCartFromPages" id="addToCartFromPages">             
<input type="hidden" value="<?=$DomenLocked?>" name="addToCartFromPagesDomen" id="addToCartFromPagesDomen">
</form>
                                <div align="center" style="padding:10">
                                    <BUTTON style="width: 150px; height: 40px; margin-left:5" title="Приобрести техническую поддержку"  onclick="DoUpgrade('product_support');
                                            return false;">
                                        Приобрести техническую поддержку на 1 год
                                    </BUTTON>
                                </div>
                            </td>
                            <td valign="top">
                                <table cellSpacing=0 cellPadding=0 width="100%">
                                    <tr>
                                        <td id=pane align=center>
                                            <img src=../img/arrow_d.gif width=7 height=7 border=0 hspace=5><span name=txtLang id=txtLang>Лицензионное соглашение</span>
                                        </td>
                                    </tr>
                                    <tr>
                                        <td>
                                            <div style="width:98%;HEIGHT: 290;overflow:auto;background-color:ffffff;padding:5px">
                                                <span id=license>

                                                    <p><strong>ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ НА ИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ПРОДУКТА "PHPShop"</strong></p>

                                                    <p>Настоящее Лицензионное Соглашение заключается между пользователем программного продукта "PHPShop" (далее Пользователь) и ООО "ПХПШОП" (далее Автор). Перед использованием продукта внимательно ознакомьтесь с условиями данного соглашения. Если вы не согласны с условиями данного соглашения, вы не можете использовать данный продукт. Установка и использование продукта (в том числе просмотр исходного кода) означает ваше полное согласие со всеми пунктами настоящего соглашения. Соглашение относится ко всем коммерчески распространяемым версиям и модификациям программного продукта PHPShop.</p>
                                                    <p>Основные термины настоящего соглашения: ЭКЗЕМПЛЯР ПРОГРАММЫ - копия продукта "PHPShop", включающая в себя код программы Интернет-магазина, воспроизведенный в файлах, включая электронную или распечатанную документацию.</p>
                                                    <p>Лицензионное соглашение вступает в силу с момента приобретения или установки продукта и действует на протяжении всего срока использования продукта. </p>
                                                    <p>1.<b>	Предмет лицензионного соглашения</b>
                                                        <br>1.1.	Предметом настоящего лицензионного соглашения является право использования одного экземпляра программного продукта (в дальнейшем "ЭКЗЕМПЛЯР ПРОГРАММЫ", "программа" или "продукт") "PHPShop", предоставляемое Пользователю ООО "ПХПШОП", в порядке и на условиях, установленных настоящим соглашением.
                                                        <br>1.2.	Все положения настоящего соглашения распространяются как на весь продукт в целом, так и на его отдельные компоненты.
                                                        <br>1.3.	Данное Соглашение дает право Пользователю на использование одной копии Продукта на одном web-сервере в пределах одного домена.
                                                        <br>1.4.	Лицензионное соглашение не предоставляет право собственности на продукт "PHPShop" и его компоненты, а только право использования ЭКЗЕМПЛЯРА ПРОГРАММЫ и его компонентов в соответствии с условиями, которые обозначены в пункте 3 настоящего соглашения.
                                                    <p><b>2.	Авторские права </b>
                                                        <br>2.1.	Все авторские права на Продукт, включая документацию и исходный текст, принадлежат Автору, на основании свидетельств о государственной регистрации программы для ЭВМ "PHPShop" №2006614274 и №2010611237.
                                                        <br>2.2. Продукт в целом или по отдельности является объектом авторского права и защищен Законом РФ "О правовой охране программ для электронных вычислительных машин и баз данных" от 23 сентября 1992 года, Законом РФ "Об авторском праве и смежных правах" от 9 июля 1993 года, а также международными Договорами.
                                                        <br>2.3. В случае нарушения авторских прав предусматривается ответственность в соответствии с действующим законодательством РФ.
                                                    <p>3.<b> 	Условия использования продукта и ограничения </b>
                                                        <BR>3.1.	Пользователь имеет право бесплатно воспользоваться демо-версией Продукта, скачав с сайта Лицензиара www.phpshop.ru и установив на сервер в течении 30 дней, и без ограничений времени при установке на локальном компьютере. Демо-версии всех версий Продукта PHPShop работают без каких-либо ограничений функциональности, кроме количества выгрузки товаров в обработчике 1С версии PHPShop Enterprise Pro.
                                                        <br>3.2.	Для каждой новой установки Продукта на другой адрес web-сервера должна быть приобретена отдельная Лицензия. Перевод лицензии на новый домен возможен только при активной технической поддержке.
                                                        <br>3.3.	Автор оставляет за собой право требовать размещения обратной ссылки, с указанием Авторского права на сайте, где используется Продукт. Использование Продукта с нарушением условий данного Соглашения, является нарушением законов об авторском праве, и будет преследоваться в соответствии с действующим законодательством. Отказ от размещения обратной ссылки с указанием Авторского права является нарушением Соглашения и ограничивает Продукт в предоставлении технической поддержки Автором на все сайты Пользователя.
                                                        <br>3.4.	Вид ссылки и размещение строго задается Автором, код ссылки не поддается изменению. В целях сохранения визуализации с персональным дизайном возможно изменение цвета ссылки (задается лицензией).
                                                        <br>3.5.	Для официальных партнеров, после письменного согласования с Автором, ссылка размещается в удобном для них месте, на каждой странице сайта. Лицензия без копирайтов Автора увеличивает стоимость Продукта на 7000 руб.

                                                        <br>3.6.	Версии Enterprise и EnterprisePro поддерживают размещение в некорневые директории, т.е. вида seamply.ru/market1/. Размещение типа market1.seamply.ru и т.д. требует покупки отдельной Лицензии. Техническая поддержка распространяется только на одну копию Продукта. Для каждого нового экземпляра магазина, а также для магазинов некорневых директорий вида seamply.ru/market1/, требуется покупка новой технической поддержки по тарифам, указанным на сайте Лицензиара. Версии Start и Catalog поддерживают размещение только в корневой папке или поддомене. Допускается возможность создания и использования Пользователем дополнительной копии Продукта исключительно в целях тестирования или внесения изменений в исходный код, при условии, что такая копия не будет доступна третьим лицам.

                                                        <br>3.7.	После покупки товара покупателю предоставляются исходные коды php-приложения за исключением файла index.php, в котором происходит проверка лицензии и защита от несанкционированного распространения программы. Все дополнительные приложения из комплекта EasyControl предоставляются в скомпилированном виде без возможности внесения изменения в код.

                                                        <br>3.8.	Пользователь может изменять, добавлять или удалять открытые файлы приобретенного ЭКЗЕМПЛЯРА ПРОГРАММЫ "PHPShop" в соответствии с Законодательством РФ об авторском праве. Изменение скомпилированных файлов запрещено и влечет нарушение данного Соглашения в соответствии с 273 статьей УК РФ.

                                                    <p>4.<b>	Ответственность сторон</b>
                                                        <br>4.1.	Пользователь не может копировать, передавать третьим лицам или распространять, сдавать в аренду/прокатПродукт и его компоненты, в том числе, созданные на базе Продукта сайты, в любой форме, в том числе, в виде исходного текста, каким-либо другим способом.

                                                        <br>4.2.	Любое распространение Продукта без предварительного согласия Автора, включая некоммерческое, является нарушением данного Соглашения, и влечет ответственность согласно действующему законодательству.

                                                        <br><b>4.3.	Продукт поставляется на условиях "КАК ЕСТЬ" ("AS IS") без предоставления гарантий производительности, покупательной способности, сохранности данных, а также иных явно выраженных или предполагаемых гарантий.

                                                            <br>4.4.	Автор не несет какой-либо ответственности за причинение или возможность причинения вреда Вам, Вашей информации или Вашему бизнесу вследствие использования или невозможности использования Продукта. </b>

                                                        <br>4.5.	Автор не несет ответственность, связанную с привлечением Вас к административной или уголовной ответственности за использование Продукта в противозаконных целях (включая, но не ограничиваясь, продажей через Интернет магазин объектов, изъятых из оборота или добытых преступным путем, предназначенных для разжигания межрасовой или межнациональной вражды; и т.д.).
                                                        <br>4.6.	Автор не несет ответственности за работоспособность Продукта, в случае внесения Вами каких бы то ни было изменений в код программы.
                                                        <br>4.7.	Запрещается любое использование Продукта, противоречащее действующему законодательству РФ.
                                                        <br>4.8.	За нарушение условий настоящего соглашения наступает ответственность, предусмотренная законодательством РФ.
                                                    <p>5.<b>	Условия технической поддержки</b>
                                                        <br>5.1.	Приобретая Интернет-магазина PHPShop Enterprise, Пользователь получает бесплатную базовую техническую поддержку в течении 6 месяцев. Для версий PHPShop Start и PHPShop Catalog срок поддержки составляет 3 месяца.

                                                        <br>5.2.	Техническая поддержка предусматривает доступ к обновлениям, технические консультации, устранение ошибок в программном продукте "PHPShop", выявленных в течение гарантийного периода.

                                                        <br>5.3.	В поддержку включены консультации по поводу управления и заполнения магазина. Настройки связи с 1С (подключение к серверу и синхронизация данных). Вопросы по поводу установки продукта на сервер, решения проблем, мешающие установки продукта на сервер. Установка и настройка дополнительных бесплатных утилит из пакета EasyControl.

                                                        <br>5.4.	Консультации проводятся в специальном разделе сайта службы технической поддержки <a target="_blank" href="https://help.phpshop.ru/">help.phpshop.ru</a> ООО "ПХПШОП" в течение гарантийного срока по рабочим дням (за исключением выходных и нерабочих праздничных дней Российской Федерации) с 10 до 18 часов московского времени.

                                                        <br>5.5.	По истечению срока бесплатной технической поддержки, Пользователь может приобрести продление. Срок действия технической поддержки продлевается на один год с момента оплаты продления. Пользователь также получает возможность загрузить и установить все изменения и обновления, которые были выпущены к программному продукту до момента оплаты продления технической поддержки. Действующий прайс-лист для приобретения технической поддержки указан на интернет-сайте <a target="_blank" href="http://www.phpshop.ru/docs/techpod.html">http://www.phpshop.ru/docs/techpod.html</a>.
                                                        <br>5.6.	Проблемы, не относящиеся к базовой технической поддержке, не могут быть бесплатно решены. Для выявления и решения таких проблем следует оплатить дополнительные технические работы. Полный список платных технических работ доступен по ссылке: <a target="_blank" href="https://help.phpshop.ru/knowledgebase.php?article=116">https://help.phpshop.ru/knowledgebase.php?article=116</a>
                                                        <br>5.7.	Персональные доработки и модули, выполненные под заказ, поддерживаются бесплатно в течении 1 месяца. Дальнейшая поддержка по тарифам, указанным по адресу: <a target="_blank" href="http://phpshop.ru/docs/techpod.html">http://phpshop.ru/docs/techpod.html</a>.

                                                    <p>6.<b>Политика возврата денежных средств</b>
                                                        <br>6.1.	В связи с тем, что перед приобретением, Автором предоставлено право проверить соответствие Продукта потребностям Пользователя, а именно, установить демо-версию Продукта, согласно п. 3.1. настоящего Соглашения, а также, по причине того, что Автор при продаже передает нематериальный продукт, не подлежащий возврату физически, возврат денежных средств Пользователю возможен, если Продукт явно не соответствует функциям, которые описаны в Руководстве Пользователя по адресу: <a target="_blank" href="http://wiki.phpshop.ru">http://wiki.phpshop.ru</a>
                                                        <br>6.2.	Любые другие потребительские свойства, предполагаемые, но не обнаруженные  пользователем при покупке, кроме описанных в  <a target="_blank" href="http://wiki.phpshop.ru">http://wiki.phpshop.ru</a> и на сайте Автора, не могут являться причиной для возврата денежных средств.
                                                        <br>6.3.	Возврат денежных средств осуществляется без комиссий банков и других платежей, по письменному заявлению Пользователя, не позднее 30 (тридцати) календарных дней с момента приобретения Продукта. В заявлении необходимо указать, что Пользователь гарантирует неиспользование Продукта, а также удаление всех без исключения полученных от Автора файлов, имеющих отношение к Продукту.
                                                        <br>6.4.	По истечении 30 (тридцати) дней с момента приобретения Продукта, претензии Автором не принимаются и денежные средства не возвращаются.
                                                        <br>6.5.	Возврат осуществляется в течение 15 (пятнадцати) календарных дней с момента получения письменного заявления в случае принятия Автором решения о возврате денежных средств Пользователю.
                                                        <br>6.6.	Бесплатные утилиты EasyControl, кроме платной синхронизации с 1С, предоставляются на условиях работы КАК ЕСТЬ" ("AS IS"), и не могут быть причиной возврата денежных средств за Продукт.

                                                    <p>7.<b>	Изменение и расторжение соглашения </b>
                                                        <br>7.1.	В случае невыполнения пользователем одного из вышеуказанных положений, ООО "ПХПШОП" имеет право в одностороннем порядке расторгнуть настоящее соглашение, уведомив об этом пользователя.
                                                        <br>7.2.	При расторжении соглашения Пользователь обязан прекратить использование продукта и удалить Лицензия полностью.
                                                        <br>7.3.	Пользователь вправе расторгнуть данное соглашение в любое время, полностью удалив ЭКЗЕМПЛЯР ПРОГРАММЫ "PHPShop", при этом, расторжение Соглашения не обязывает Автора возвращать средства, потраченные Пользователем на приобретение Продукта.
                                                        <br>7.4.	В случае если компетентный суд признает какие-либо положения настоящего соглашения недействительными, Соглашение продолжает действовать в остальной части.
                                                        <br>7.5.	Настоящее лицензионное соглашение также распространяется на все обновления, предоставляемые пользователю в рамках технической поддержки, если только при обновлении программного продукта пользователю не предлагается ознакомиться и принять новое лицензионное соглашение или дополнения к действующему соглашению.
                                                    </p>

                                                    <p><strong>Контактная информация компании ООО "ПХПШОП"</strong><br>
                                                        Адрес сайта: <a href="http://www.phpshop.ru" target="_blank">www.phpshop.ru</a> <br>
                                                        Учебник: <a href="http://www.phpshop.ru/help/" target="_blank">www.phpshop.ru/help/</a> <br>
                                                        E-mail отдела продаж: <a href="mailto:sales@phpshop.ru">sales@phpshop.ru</a><br>
                                                        Телефон отдела продаж: +7 (495) 989-11-15 <br>
                                                        Раздел техподдержки на сайте: <a href="http://www.help.phpshop.ru" target="_blank">help.phpshop.ru</a> <br>
                                                        E-mail администрации: <a href="mailto:mail@phpshop.ru">mail@phpshop.ru</a></p>
                                                </span></div>
                                            <br>
                                            <input type="checkbox" checked disabled><span name=txtLang id=txtLang>Я принимаю условия лицензионного соглашения</span>
                                        </td>
                                    </tr>
                                </table>
                            </td>
                        </tr>
                    </table>
                    <hr>
                    <table width="100%" cellpadding="0" cellpadding="0">
                        <tr>
                            <td style="padding-left:10px">
                                <?
                                if ($License['License']['RegisteredTo'] == "Trial NoName") {
                                    ?>
                                    <BUTTON style="width: 15em; height: 2.2em; margin-top:5" type=submit onClick="window.open('http://www.phpshop.ru/order/2.html', '_blank');" name="btnLang"><img src="../icon/key_add.gif" alt="" width="16" height="16" border="0" align="absmiddle" hspace="5">Купить лицензию</BUTTON>
                                <? } ?>
                            </td>
                            <td align="right" style="padding:10">	<BUTTON style="width: 7em; height: 2.2em; margin-top:5" type=submit onClick="return onCancel();" name="btnLang">Закрыть</BUTTON></td>
                        </tr>
                    </table>

                    </body>
                    </html>
