<?
require("../connect.php");
@mysql_connect ("$host", "$user_db", "$pass_db")or @die("Невозможно подсоединиться к базе");
mysql_select_db("$dbase")or @die("Невозможно подсоединиться к базе");

require("../enter_to_admin.php");
require("../class/xml.class.php");

// Языки
$GetSystems=GetSystems();
$option=unserialize($GetSystems['admoption']);
$Lang=$option['lang'];
require("../language/".$Lang."/language.php");



// Выбор файла
function GetFile($dir){
global $SysValue;
    if ($dh = opendir($dir)) {
        while (($file = readdir($dh)) !== false) {
		$fstat = explode(".",$file);
		if($fstat[1] == "lic")
		  return $SysValue['license']['dir'].chr(47).$file;
        }
        closedir($dh);
    }
}

// Срок действия тех. поддержки
$GetFile=GetFile("../../../license/");
@$License=parse_ini_file("../../../".$GetFile,1);

$TechPodUntilUnixTime = $License['License']['SupportExpires'];
if(is_numeric($TechPodUntilUnixTime))
$TechPodUntil=dataV($TechPodUntilUnixTime);
  else $TechPodUntil=" - ";

$DomenLocked=$License['License']['DomenLocked'];
if(empty($DomenLocked))
  $DomenLocked=$SERVER_NAME;
  
  
$LicenseUntilUnixTime = $License['License']['Expires'];
if(is_numeric($LicenseUntilUnixTime))
$LicenseUntil=dataV($LicenseUntilUnixTime);
  else  $LicenseUntil=" - ";
?>
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
	<title>О Программе</title>
<META http-equiv=Content-Type content="text/html; charset=<?=$SysValue['Lang']['System']['charset']?>">
<LINK href="../css/texts.css" type=text/css rel=stylesheet>
<script language="JavaScript1.2" src="../java/javaMG.js" type="text/javascript"></script>
<script type="text/javascript" language="JavaScript1.2" src="../language/<?=$Lang?>/language_windows.js"></script>
<script>
DoResize(<? echo $GetSystems['width_icon']?>,670,530);
</script>
</head>
<body bottommargin="0" topmargin="0" leftmargin="0" rightmargin="0" onload="DoCheckLang(location.pathname,<?=$SysValue['lang']['lang_enabled']?>);preloader(0)">

<table id="loader">
<tr>
	<td valign="middle" align="center">
		<div id="loadmes" onclick="preloader(0)">
<table width="100%" height="100%">
<tr>
	<td id="loadimg"></td>
	<td ><b><?=$SysValue['Lang']['System']['loading']?></b><br><?=$SysValue['Lang']['System']['loading2']?></td>
</tr>
</table>
		</div>
</td>
</tr>
</table>

<SCRIPT language=JavaScript type=text/javascript>preloader(1);</SCRIPT>

<table cellpadding="0" cellspacing="0" width="100%" height="50" id="title">
<tr bgcolor="#ffffff">
	<td style="padding:10">
	<b><span name=txtLang id=txtLang>О программе</span> <?= $ProductName?></b><br>
	&nbsp;&nbsp;&nbsp;<span name=txtLang id=txtLang>Версии модулей и лицензионное соглашение</span>.
	</td>
	<td align="right">
	<img src="../img/i_addremove_med[1].gif" border="0" hspace="10">
	</td>
</tr>
</table>
<table cellSpacing=0 cellPadding=0 width="100%">
<tr>
	<td>

<TABLE cellSpacing=0 cellPadding=0 width="100%">
<TR>
<TD vAlign=top  width="200">
<table width="100%" cellpadding="5" cellspacing="1" height="100%">
<tr>
	<td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Название</span></td>
    	<td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Версия</span></td>
</tr>
<tr bgcolor="#ffffff">
	<td><?=$ProductName;?></td>
	<td>
	<?=$SysValue['upload']['version'];?>
	</td>
</tr>
<tr>
	<td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Поддержка</span></td>
	<td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Дата</span></td>
</tr>
<tr bgcolor="#ffffff">
	<td><span name=txtLang id=txtLang>Окончание</span></td>
	<td>
	<?=$TechPodUntil;?>
	</td>
</tr>
<tr>
	<td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Лицензия</span></td>
	<td id=pane align=center><img src="../img/arrow_d.gif" alt="" width="7" height="7" border="0" hspace="5"><span name=txtLang id=txtLang>Дата</span></td>
</tr>
<tr bgcolor="#ffffff">
	<td><span name=txtLang id=txtLang>Окончание</span></td>
	<td>
	<?=$LicenseUntil;?>
	</td>
</tr>
</table>

<div align="center" style="padding:10">
<a href="http://www.phpshop.ru/docs/techpod.html" target="_blank" style="color:blue" title="Перейти на сайт разработчика для подробной информации"><span name=txtLang id=txtLang>Пролонгация технической поддержки</span></a>
</div>
<div align="center" style="padding:10">
<input type="button" value="Проверить лицензию" onclick="window.open('http://www.phpshop.ru/chek/?name=<?=$DomenLocked?>')">
</div>
</td>
	<td valign="top">
<table cellSpacing=0 cellPadding=0 width="100%">
<tr>
   <td id=pane align=center>
   <img src=../img/arrow_d.gif width=7 height=7 border=0 hspace=5><span name=txtLang id=txtLang>Лицензионное соглашение</span>
   </td>
</tr>
<tr>
	<td>
	<div style="width:98%;HEIGHT: 290;overflow:auto;background-color:ffffff;padding:5px">
	<span id=license>

	<p><strong>ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ НА ИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ПРОДУКТА "PHPShop"</strong></p>

<p>Настоящее лицензионное соглашение заключается между пользователем программного продукта "PHPShop" (далее Пользователь) и ООО "ПХПШОП". Перед использованием продукта внимательно ознакомьтесь с условиями данного соглашения. Если вы не согласны с условиями данного соглашения, вы не можете использовать данный продукт. Установка и использование продукта означает ваше полное согласие со всеми пунктами настоящего соглашения. Соглашение относится ко всем коммерчески распространяемым версиям и модификациям программного продукта PHPShop.</p>

<p>Основные термины настоящего соглашения: ЭКЗЕМПЛЯР ПРОГРАММЫ - копия продукта "PHPShop", включающая в себя код программы Интернет-магазина, воспроизведенный в файлах или на бумаге, включая электронную или распечатанную документацию.</p>

<p>Лицензионное соглашение вступает в силу с момента приобретения или установки продукта и действует на протяжении всего срока использования продукта. </p>

<p>1.	<strong>Предмет лицензионного соглашения</strong><br>
1.1.	Предметом настоящего лицензионного соглашения является право использования одного экземпляра программного продукта (в дальнейшем "ЭКЗЕМПЛЯР ПРОГРАММЫ", "программа" или "продукт") "PHPShop", предоставляемое Пользователю ООО "ПХПШОП", в порядке и на условиях, установленных настоящим соглашением.</p>

<p>1.2.	Все положения настоящего соглашения распространяются как на весь продукт в целом, так и на его отдельные компоненты. </p>

<p>1.3.	Данное Соглашение дает право Пользователю на использование неограниченного количества копии Продукта на одном web-сервере в пределах 
одного домена. </p>

<p>1.4.	Лицензионное соглашение не предоставляет право собственности на продукт "PHPShop" и его компоненты, а только право использования ЭКЗЕМПЛЯРА ПРОГРАММЫ и его компонентов в соответствии с условиями, которые обозначены в пункте 3 настоящего соглашения.</p>

<p>1.5 Правом использования продукта <?=$ProductName?> на сервере <?=$SERVER_NAME?>  обладает <?if(!empty($License['License']['RegisteredTo'])) echo $License['License']['RegisteredTo'];
 else echo "Trial NoName";?>
 </p>

<p>2.	<strong>Авторские права</strong><br>
2.1. Все авторские права на Продукт, включая документацию и исходный текст  принадлежат Автору, на основании свидетельства о государственной регистрации программы для ЭВМ "PHPShop" № 2006614274. OOO "ПХПШОП" имеет исключительное право на продажу для ЭВМ "PHPShop", регламентированное лицензионным договором о передаче исключительных права на продажу между Автором и ООО "ПХПШОП" за номером 1414 от 20.12.2006г.  </p>

<p>2.2. Продукт в целом или по отдельности является объектом авторского права и защищен Положениями части четвертой ГК РФ. </p>

<p>2.3. В случае нарушения авторских прав предусматривается ответственность в соответствии с действующим законодательством РФ.</p>

<p>3.	<strong>Условия использования продукта и ограничения</strong><br>
3.1.	Пользователь имеет право бесплатно воспользоваться демо-версией Продукта, скачав с сайта Лицензиара <a href="http://www.phpshop.ru/load/" target="_blank">www.phpshop.ru</a> и установив на сервер в течении 45 дней, и без ограничений времени при установке на локальном компьютере. Демо-версии всех версий Продукта PHPShop работают без каких-либо ограничений функциональности, кроме количества выгрузки товаров в обработчике 1С версии PHPShop Enterprise Pro.</p>

<p>3.2.	Пользователь имеет право на использование неограниченного количества копий Продукта на одном web-сервере в пределах одного домена. Перевод лицензии на новый домен возможен только при активной технической поддержке.
3.3.	Для каждой новой установки Продукта на другой адрес web-сервера должна быть приобретена отдельная Лицензия.</p>

<p>3.4.	Автор оставляет за собой право требовать размещения обратной ссылки с указанием Авторского права на сайте, где используется Продукт. Использование Продукта с нарушением условий данного Соглашения, является нарушением законов об авторском праве, и будет преследоваться в соответствии с действующим законодательством. Отказ от размещения обратной ссылки с указанием Авторского права является нарушением Соглашения и ограничивает Продукт в предоставлении технической поддержки Автором. </p>

<p>3.5.	 Вид ссылки и размещение строго задается Автором, код ссылки не поддается изменению. В целях сохранения визуализации с персональным дизайном возможно изменение цвета ссылки (задается лицензией). </p>

<p>3.6.	 Для официальных партнеров возможна выписка лицензии без копирайтов Автора. Ссылка в таком случае размещается в согласовании с Автором партнерами в удобной для них месте каждой страницы сайта. Лицензия без копирайтов автора обговаривается отдельно, стоимость такой лицензии назначается персонально. </p>

<p>3.7.	Версии Enterprise и Enterprise Pro поддерживают размещение в некорневые директории, т.е. вида seamply.ru/market1/. Размещение типа market1.seamply.ru и т.д. требует покупки отдельной Лицензии. Техническая поддержка распространяется только на одну копию Продукта. Для каждого нового экземпляра магазина, а также для магазинов некорневых директорий вида seamply.ru/market1/, требуется покупка новой технической поддержки по тарифам, указанным на сайте Лицензиара.</p>

<p>3.8.	 Версии Start и Catalog, Catalog Pro поддерживают размещение только в корневой папке или поддомене. Допускается возможность создания и использования Пользователем дополнительной копии Продукта исключительно в целях тестирования или внесения изменений в исходный код, при условии, что такая копия не будет доступна третьим лицам. </p>

<p>3.9.	 Пользователь не может копировать программу, передавать ее третьим лицам или распространять программу и ее компоненты, а также созданные на базе программы сайты, в любой форме, в том числе в виде исходного текста, каким-либо способом, в том числе сдавать в аренду/прокат программу и ее компоненты, а также созданные на ее базе  сайты.</p>

<p>3.10.	Пользователь может изменять, добавлять или удалять любые файлы приобретенного ЭКЗЕМПЛЯРА ПРОГРАММЫ "PHPShop" в соответствии с Законодательством РФ об авторском праве.</p> 

<p>3.11.	Запрещается любое использование Продукта, противоречащее действующему законодательству РФ. </p>

<p>4.	<strong>Ответственность сторон</strong><br>
4.1.	Любое распространение Продукта без предварительного согласия Автора, включая некоммерческое, является нарушением данного Соглашения и влечет ответственность согласно действующему законодательству. </p>

<p>4.2.	За нарушение условий настоящего соглашения наступает ответственность, предусмотренная законодательством РФ.</p>

<p>4.3.	Продукт поставляется на условиях "КАК ЕСТЬ" ("AS IS") без предоставления гарантий производительности, покупательной способности, сохранности данных, а также иных явно выраженных или предполагаемых гарантий. Автор не несет какой-либо ответственности за причинение или возможность причинения вреда Вам, Вашей информации или Вашему бизнесу вследствие использования или невозможности использования Продукта. </p>

<p>4.4.	Автор не несет ответственность, связанную с привлечением Вас к административной или уголовной ответственности за использование Продукта в противозаконных целях (включая, но не ограничиваясь, продажей через Интернет магазин объектов, изъятых из оборота или добытых преступным путем, предназначенных для разжигания межрасовой или межнациональной вражды; и т.д.). </p>

<p>4.5.	Автор не несет ответственности за работоспособность Продукта в случае внесения Вами каких бы то ни было изменений.</p>

<p>5.	<strong>Условия технической поддержки</strong><br>
5.1.	Приобретая Интернет-магазина PHPShop Enterprise, Пользователь получает бесплатную базовую техническую поддержку в течении 6 месяцев. Для версий PHPShop Start и PHPShop Catalog срок поддержки составляет 3 месяца.</p>

<p>5.2.	Техническая поддержка предусматривает доступ к обновлениям, технические консультации,  устранение ошибок в программном продукте "PHPShop", выявленных в течение гарантийного периода. </p>

<p>5.3.	Консультации проводятся в специальном разделе сайта службы технической поддержки <a href="http://help.phpshop.ru" target="_blank">help.phpshop.ru</a> ООО "ПХПШОП" в течение гарантийного срока по рабочим дням (за исключением выходных и нерабочих праздничных дней Российской Федерации) с 10 до 18 часов московского времени.</p>

<p>5.4.	По истечению срока бесплатной технической поддержки, Пользователь может приобрести продление. Срок действия технической поддержки продлевается на один год с момента оплаты продления. Пользователь также получает возможность загрузить и установить все изменения и обновления, которые были выпущены к программному продукту до момента оплаты продления технической поддержки. Действующий прайс-лист для приобретения технической поддержки указан на интернет-сайте <a href="http://www.phpshop.ru/docs/techpod.html" target="_blank">www.phpshop.ru</a>.</p>

<p>6.	<strong>Изменение и расторжение соглашения</strong><br>
6.1.	В случае невыполнения пользователем одного из вышеуказанных положений, ООО "ПХПШОП" имеет право в одностороннем порядке расторгнуть настоящее соглашение, уведомив об этом пользователя.</p>

<p>6.2.	При расторжении соглашения Пользователь обязан прекратить использование продукта и удалить Лицензия полностью.</p>

<p>6.3.	Пользователь вправе расторгнуть данное соглашение в любое время, полностью удалив ЭКЗЕМПЛЯР ПРОГРАММЫ "PHPShop", при этом, расторжение Соглашения не обязывает Автора возвращать средства, потраченные Пользователем на приобретение Продукта, согласно ст. 25, п. 1.4 Закона РФ от 7 февраля 1992 г. N 2300-I "О защите прав потребителей" и п.14 "Перечня непродовольственных товаров надлежащего качества, не подлежащих возврату или обмену", утвержденном Постановлением Правительства РФ от 19.01.1998 № 55.</p>

<p>6.4.	В случае если компетентный суд признает какие-либо положения настоящего соглашения недействительными, Соглашение продолжает действовать в остальной части.
Настоящее лицензионное соглашение также распространяется на все обновления, предоставляемые пользователю в рамках технической поддержки, если только при обновлении программного продукта пользователю не предлагается ознакомиться и принять новое лицензионное соглашение или дополнения к действующему соглашению. </p>


<p><strong>Контактная информация компании ООО "ПХПШОП"</strong><br>
Адрес сайта: <a href="http://www.phpshop.ru" target="_blank">www.phpshop.ru</a> <br>
Учебник: <a href="http://www.phpshop.ru/help/" target="_blank">www.phpshop.ru/help/</a> <br>
E-mail отдела продаж: <a href="mailto:sales@phpshop.ru">sales@phpshop.ru</a><br>
Телефон отдела продаж: +7 (495) 989-11-15 <br>
Раздел техподдержки на сайте: <a href="http://www.help.phpshop.ru" target="_blank">help.phpshop.ru</a> <br>
E-mail администрации: <a href="mailto:mail@phpshop.ru">mail@phpshop.ru</a></p>
</span></div>
<br>
<input type="checkbox" checked disabled><span name=txtLang id=txtLang>Я принимаю условия лицензионного соглашения</span>
	</td>
</tr>
</table>
</td>
</tr>
</table>
<hr>
<table width="100%" cellpadding="0" cellpadding="0">
<tr>
   <td style="padding-left:10px">
   <?
   if($License['License']['RegisteredTo']=="Trial NoName"){
   ?>
   <BUTTON style="width: 15em; height: 2.2em; margin-top:5" type=submit onClick="window.open('http://www.phpshop.ru/order/2.html','_blank');" name="btnLang"><img src="../icon/key_add.gif" alt="" width="16" height="16" border="0" align="absmiddle" hspace="5">Купить лицензию</BUTTON>
<?}?>
</td>
	<td align="right" style="padding:10">	<BUTTON style="width: 7em; height: 2.2em; margin-top:5" type=submit onClick="return onCancel();" name="btnLang">Закрыть</BUTTON></td>
</tr>
</table>

</body>
</html>
