<?


$SysValue['Lang']['Window']=array(
"1"=>"  удалить выбранные товары",
"2"=>"  добавить в спецпредложение выбранные товары",
"3"=>"  удалить из спецпредложения выбранные товары",
"4"=>"  убрать из продажи выбранные товары",
"5"=>"  добавить в продаже выбранные товары",
"6"=>"  удалить из YML прайса выбранные товары",
"7"=>"  добавить в прайс выбранные товары",
"8"=>"  выгрузить в CSV выбранные товары",
"10"=>"  добавить в новинки выбранные товары",
"11"=>"  удалить из новинок выбранные товары",
"12"=>"  обнулить опрос",
"15"=>"  добавить в базу",
"16"=>"  удалить из журнала",
"17"=>"  удалить из базы",
"18"=>"  блокировать",
"19"=>"  разблокировать",
"20"=>"  блокировать пользователя",
"21"=>"  разблокировать пользователя",
"22"=>"  удалить выбранных пользователей",
"23"=>"  связать с тематическими статьями",
"25"=>"  разослать уведомления пользователям о наличии товара в магазине",
"26"=>"  удалить заявки пользователей",
"28"=>"  пометить товары, как есть в наличии",
"27"=>"  пометить товары, как нет в наличии",
"29"=>"  разослать автоматические уведомления пользователям о наличии товара в магазине",
"30"=>"  добавить к показу выбранные страницы",
"31"=>"  убрать из показа выбранные страницы",
"32"=>"  добавить авторизацию для выбранных страниц",
"33"=>"  удалить авторизацию для выбранных страниц",
"35"=>" добавить рекомендованные товары для выбранных страниц",
"36"=>" удалить заказы из базы",
"37"=>" изменить статус заказов",
"39"=>" удалить страницы из базы",
"40"=>" удалить изображения к товару из галереи",
"41"=>" удалить комментарии из базы",
"42"=>" удалить переписки выбранного пользователя",
"43"=>" включить вывод выбранных комментариев",
"44"=>" выключить вывод выбранных комментариев",
"45"=>" выгрузить заказы в 1С:Предприятие",
"46"=>" удалить новости из базы",
"47"=>" разослать новости пользователям",
"rss1"=>" удалить RSS канала из базы",
"rss2"=>" включить RSS канал",
"rss3"=>" ыключить RSS канал",
"rss4"=>" привязать RSS к единой дате показа",
"48"=>" убрать из показа выбранные отзывы",
"49"=>" удалить отзывы из базы",
"50"=>" добавить к показу выбранные отзывы"
);

$SysValue['Lang']['Icon']=array(
"1"=>"Новый Каталог"
);

$SysValue['Lang']['System']=array(
"status"=>"Добро Пожаловать",
"charset"=>"windows-1251",
"status2"=>"на сервер",
"loading"=>"Загрузка...",
"loading2"=>"Подождите пока интерфейс панели управления будет загружен.",
"cart1"=>"Внимание...",
"cart2"=>"Обнаружены новые заказы",
"comment"=>"Обнаружены новые комментарии",
"load"=>"Идет обработка запроса...",
"message"=>"Обнаружены новые сообщения",
"license"=>"Лицензия заканчивается через ",
"techpod"=>"Техническая поддержка заканчивается через "
);

$SysValue['Lang']['Title']=array(
"index"=>"Авторизация",
"admpanel"=>"Панель Управления",
"orders"=>"Заказы",
""=>"Заказы",
"comment"=>"Комментарии",
"news"=>"Новости",
"page_site"=>"Страницы",
"page_site_catalog"=>"Каталог страниц",
"baner"=>"Баннеры",
"page_menu"=>"Текстовые блоки",
"gbook"=>"Отзывы",
"links"=>"Ссылки",
"cat_prod"=>"Каталог товаров",
"users"=>"Администраторы",
"shopusers"=>"Пользователи",
"shopusers_status"=>"Статусы пользователей",
"csv"=>"Загрузка прайса",
"stats1"=>"Отчеты",
"opros"=>"Опросы",
"payment"=>"Способы оплаты",
"news_writer"=>"Подписчики",
"users_jurnal"=>"Журнал авторизации",
"users_jurnal_black"=>"Черный список",
"search_jurnal"=>"Журнал поиска",
"search_pre"=>"Перенаправление поиска",
"discount"=>"Ссылки",
"valuta"=>"CВалюты",
"csv_base"=>"Загрузка базы",
"sort"=>"Характеристики",
"sort_group"=>"Группы характеристик",
"delivery"=>"Доставка",
"servers"=>"Клоны-магазины",
"shopusers_notice"=>"Уведомления пользователей",
"shopusers_messages"=>"Сообщения пользователей"
);

$SysValue['Lang']['Help']=array(
"Help"=>"Помощь",
"forma_1"=>"Установите начальную дату",
"forma_2"=>"Установите конечную дату",
"forma_3"=>"Поиск выполняется по номеру заказа или именем покупателя с соблюдением заглавных букв",
"forma_4"=>"Поиск выполняется по номеру заказа",
"4"=>"Поиск выполняется по ссылки страницы или ее имени",
"5"=>"Поиск выполняется по имени пользователя или его e-mail",
"6"=>"Поиск выполняется по идентификатору ID товара"
);

$SysValue['Lang']['Order']=array(
"1"=>"Счет в банк",
"2"=>"Квитанция",
"3"=>"Наличные",
"4"=>"Кридитные карты",
"5"=>"Пользователь",
"6"=>"Гость"
);

$SysValue['Lang']['Category']=array(
"1"=>"Каталог",
"2"=>"Загруженные товары",
"3"=>"1C База",
"4"=>"Excel База",
"5"=>"Открыть все",
"6"=>"Закрыть все",
"7"=>"Закрыть окно",
"8"=>"Меню",
"9"=>"Главное меню сайта",
"10"=>"Начальная страница",
"11"=>"Корневая категория",
"12"=>"Меню -> Главное меню сайта",
"13"=>"Меню -> Приветственное сообщение",
"14"=>" !!! Временная папка !!!",
"15"=>"Пользователи",
"16"=>"Список доставок"
);
?>
