Доброго времени!
--------------------------------------------------------

Новый статус вашего заказа № @ouid@ от @date@ - "@status@".

@php
if(empty($GLOBALS['SysValue']['other']['user'])){
echo "
Вы всегда можете проверить статус заказа, загрузить файлы, распечатать платежные
документы он-лайн по ссылке http://".$_SERVER["SERVER_NAME"].$GLOBALS["SysValue"]["dir"]["dir"]."/clients/?mail=@mail@&order=@ouid@";
}
else { echo "
Вы всегда можете проверить статус заказа, загрузить файлы, распечатать платежные
документы он-лайн через Личный кабинет или по ссылке http://".$_SERVER["SERVER_NAME"].$GLOBALS["SysValue"]["dir"]["dir"]."/users/";
}
php@

---------------------------------------------------------
С уважением,
Компания @company@
