Доброго времени!
--------------------------------------------------------
Спасибо за покупку в нашем интернет-магазине @shop_name@
Наши менеджеры свяжутся с вами по координатам,
оставленным в форме заказа.


Подробности заказа № @ouid@ от @date@
--------------------------------------------------------
Контактное лицо: @name_person@
Телефон: @tel@
Адрес и доп. инф: @adr_name@
Желаемое время доставки: @dos_ot@ - @dos_do@
Грузополучатель: @deliveryCity@
E-mail: @mail@
Тип оплаты: @payment@
@php
if(!empty($_POST["org_name"])) {
echo "Компания: ".$_POST["org_name"]."
ИНН: ".$_POST["org_inn"]."
КПП: ".$_POST["org_kpp"];
}
php@

Заказанные товары
--------------------------------------------------------
@cart@
-------------------------------------------------------
Итого -- @sum@ @currency@
Скидка -- @discount@%
Доставка -- @deliveryPrice@ @currency@
-------------------------------------------------------
К оплате с учетом скидки: @total@ @currency@

@php
if(!$_SESSION["UsersId"]){
echo "
E-mail: ".$_POST["mail"]."
№ Заказа: ".$_POST["ouid"]."

Вы всегда можете проверить статус заказа, загрузить файлы, распечатать платежные
документы он-лайн по ссылке http://".$_SERVER["SERVER_NAME"].$GLOBALS["SysValue"]["dir"]["dir"]."/clients/?mail=".$_POST["mail"]."&order=".$_POST["ouid"]."

";
}
else { echo "Вы всегда можете проверить статус заказа, загрузить файлы, распечатать платежные
документы он-лайн через Личный кабинет или по ссылке http://".$_SERVER["SERVER_NAME"].$GLOBALS["SysValue"]["dir"]["dir"]."/users/";
}
php@

---------------------------------------------------------
С уважением,
Компания @company@
