CREATE TABLE `phpshop_modules_avito_xml_prices` (
  `id` int(11) NOT NULL auto_increment,
  `name` varchar(64),
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

INSERT INTO `phpshop_modules_avito_xml_prices` (`id`, `name`) VALUES
(1, 'Бытовая электроника'),
(2, 'Для дома и дачи');

ALTER TABLE `phpshop_modules_avito_categories` ADD `xml_price_id` int(11) NOT NULL;

CREATE TABLE `phpshop_modules_avito_subtypes` (
  `id` int(11) NOT NULL auto_increment,
  `name` varchar(64),
  `type_id` int(11) NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- Для дома и дачи
INSERT INTO `phpshop_modules_avito_categories` (`id`, `name`, `xml_price_id`) VALUES
(10, 'Ремонт и строительство', 2),
(11, 'Мебель и интерьер', 2),
(12, 'Бытовая техника', 2),
(13, 'Посуда и товары для кухни', 2),
(14, 'Растения', 2),
(15, 'Продукты питания', 2);

INSERT INTO `phpshop_modules_avito_types` (`id`, `name`, `category_id`) VALUES
(105, 'Двери', 10),
(106, 'Инструменты', 10),
(107, 'Камины и обогреватели', 10),
(108, 'Окна и балконы', 10),
(109, 'Потолки', 10),
(110, 'Садовая техника', 10),
(111, 'Сантехника и сауна', 10),
(112, 'Стройматериалы', 10),
(113, 'Компьютерные столы и кресла', 11),
(114, 'Кровати, диваны и кресла', 11),
(115, 'Кухонные гарнитуры', 11),
(116, 'Освещение', 11),
(117, 'Подставки и тумбы', 11),
(118, 'Предметы интерьера, искусство', 11),
(119, 'Столы и стулья', 11),
(120, 'Текстиль и ковры', 11),
(121, 'Шкафы и комоды', 11),
(122, 'Другое', 11),
(123, 'Пылесосы', 12),
(124, 'Стиральные машины', 12),
(125, 'Утюги', 12),
(126, 'Швейные машины', 12),
(127, 'Бритвы и триммеры', 12),
(128, 'Машинки для стрижки', 12),
(129, 'Фены и приборы для укладки', 12),
(130, 'Эпиляторы', 12),
(131, 'Вытяжки', 12),
(132, 'Мелкая кухонная техника', 12),
(133, 'Микроволновые печи', 12),
(134, 'Плиты', 12),
(135, 'Посудомоечные машины', 12),
(136, 'Холодильники и морозильные камеры', 12),
(137, 'Вентиляторы', 12),
(138, 'Кондиционеры', 12),
(139, 'Обогреватели', 12),
(140, 'Очистители воздуха', 12),
(141, 'Термометры и метеостанции', 12),
(142, 'Другое', 12),
(143, 'Посуда', 13),
(144, 'Товары для кухни', 13);

INSERT INTO `phpshop_modules_avito_subtypes` (`id`, `name`, `type_id`) VALUES
(1, 'Изоляция', 112),
(2, 'Крепёж', 112),
(3, 'Кровля и водосток', 112),
(4, 'Листовые материалы', 112),
(5, 'Металлопрокат', 112),
(6, 'Общестроительные материалы', 112),
(7, 'Отделка', 112),
(8, 'Пиломатериалы', 112),
(9, 'Строительные смеси', 112),
(10, 'Строительство стен', 112),
(11, 'Электрика', 112),
(12, 'Другое', 112);

ALTER TABLE `phpshop_categories` ADD `subtype_avito` int(11) DEFAULT NULL;
ALTER TABLE `phpshop_modules_avito_system` ADD `image_url` varchar(255) default '';