
<div class="card">
    <ul class="table-view">
        <li class="table-view-divider">
            Ошибка 404
        </li>
        <li class="table-view-cell">
            <b>Возможные причины:</b>
            <ol> 
                <li>Страница доступна только для авторизованных пользователей
                <li>Ссылка набрана неправильно.
                <li>Ссылка, из поисковой машины или с сайта, устарела.
                <li>Страница удалена или перемещена администратором.
            </ol>
        </li>
    </ul>
</div>