// Locale
var locale = {
charset: "utf-8",
commentList: {
mesHtml: "մեկնաբանություններ ավելացնելու գործառույթը հնարավոր է միայն լիազորված օգտվողների համար:\n<a href='/users/?from = true ' >մուտք գործել կամ գրանցվել</a>.",
mesSimple: "մեկնաբանություններ ավելացնելու գործառույթը հնարավոր է միայն լիազորված օգտվողների համար:\ավտորիզվեք կամ գրանցվեք:",
mes: "ձեր մեկնաբանությունը հասանելի կլինի այլ օգտվողներին միայն մոդերացիայի անցնելուց հետո:.."
},
OrderChekJq: {
badReqEmail: "խնդրում ենք նշել ճիշտ e-mail",
badReqName: "խնդրում ենք նկատի ունենալ,\pimya պետք է բաղկացած լինի ոչ պակաս, քան 3 տառերով",
badReq: "խնդրում ենք նկատի ունենալ,\անագ դաշտերը պարտադիր է լրացնել",
badDelivery: "Խնդրում ենք \ pvyber առաքում"
},
commentAuthErrMess: "Ավելացնել մեկնաբանություններ կարող է միայն լիազորված օգտվողին.\n<a href='" + ROOT_PATH + "/users/?from = ճիշտ ' >խնդրում ենք մուտք գործել կամ գրանցվել</a>.",
incart: "զամբյուղում",
cookie_message: "այս կայքում առավել օպերատիվ ծառայություն մատուցելու նպատակով օգտագործվում են cookie-ֆայլեր ։ Օգտագործելով այս կայքը, Դուք համաձայնում եք օգտագործել մեր cookie-ները ։ ",
show: "ցույց տալ",
hide: "թաքցնել",

};

$().ready(function () {
    locale_def = locale;
});