Доброго времени!
--------------------------------------------------------

Поступила ссылка на меньшую цену с интернет-магазина '@name@'

Подробности сообщения:
---------------------------------------------------------
Контактное лицо: @user_name@
Компания: @user_org_name@
Телефон: @user_tel_code@-@user_tel@
Доп. инф: @user_info@
E-mail: @user_mail@
Ссылка на меньшую цену: @link_to_page@

Данные товара:
---------------------------------------------------------
Наименование: @product_name@
Артикул: @product_art@
ID: @product_id@
Прямая ссылка: @product_link@
Дата/время: @date@
IP: @user_ip@
