<?php

function tab_info($data) {
    global $PHPShopGUI;
    
    $Info = '<p>
      <h4>Настройки параметров размещения в Яндекс.Маркет по модели ADV</h4>
        <ol>
        <li>В поле "Прайс-лист" указать адрес YML файла: <code>http://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/yml/</code>
        </ol>
        <h5>Настройка модуля</h5>
        <ol>
        <li>В модуле выбрать Модель работы <kbd>ADV</kbd>. Нажать кнопку <b>Сохранить</b></li>
       <li>Поле пароль <b>защищает</b> от несанкционированной кражи контента. При использовании пароля ссылка на файл YML примет вид <code>http://' . $_SERVER['SERVER_NAME'] . '/yml/yandex.php?pas=*******</code>. При использовании пароля требуется так же заменить ссылку в Яндекс.Маркете.
</li> 
        <li>Флаг SSL добавляет к ссылкам на товар протокол HTTPS.</li>
        <li>Колонка цен служит для вывода дополнительных цен из карточки товара.</li>
      </ol>
      
      <h4>Настройка параметров размещения в Яндекс.Маркет по модели DBS</h4>
        <ol>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Ассортимент</b>/<b>Автоматическое обновление каталога</b>, указать адрес YML файла: <code>http://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/yml/</code></li>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Настройки</b>/<b>Выбор способа подтверждения</b>, выбрать <b>Как вы будете подтверждать заказы</b> значение <kbd>Через API</kbd></li>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Настройки</b>/<b>Настройка API</b>, указать в поле <kbd>URL для запросов API</kbd> значение <code>https://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/phpshop/modules/yandexcart/api.php</code></li>
        <li>В разделе <b>Настройка API</b> заполнить <kbd>SHA1-отпечаток SSL-сертификата</kbd>, его необходимо взять из информации о SSL сертификате вашего сайта.</li>
        <li>В разделе <b>Настройка API</b> выбрать <b>Тип авторизации</b> <kbd>URL</kbd>.</li>
        <li>В разделе <b>Настройка API</b> включить <kbd>Автоматическое обновление данных об остатках товаров</kbd>.</li>
        </ol>
        <h5>Настройка модуля</h5>
        <ol>
        <li>Выбрать Модель работы <kbd>DBS</kbd>. Нажать кнопку <b>Сохранить</b></li>
        <li>Поле пароль <b>защищает</b> от несанкционированной кражи контента. При использовании пароля ссылка на файл YML примет вид <code>http://' . $_SERVER['SERVER_NAME'] . '/yml/yandex.php?pas=*******</code>. При использовании пароля требуется так же заменить ссылку в Яндекс.Маркете.</li> 
        <li>Флаг SSL добавляет к ссылкам на товар протокол HTTPS.</li>
        <li>Колонка цен служит для вывода дополнительных цен из карточки товара.</li>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Настройки</b>/<b>Настройка API</b> скопировать <kbd>Авторизационный токен</kbd> в поле <kbd>Авторизационный токен API</kbd> в настройках модуля.</li>
        <li>Чтобы использовать протокол OAuth при работе с партнерским API, вам необходимо <a href="https://oauth.yandex.ru/client/new" target="_blank">Зарегистрировать свое приложение</a>. 
        Обязательно необходимо ввести название приложения, оно может быть любым. В разделе <b>Платформы</b> установить галочку <kbd>Веб-сервисы</kbd>, под полем <b>Callback URI #1</b> нажать <kbd>Подставить URL для разработки</kbd>.
        В разделе <b>Доступы</b> выбрать <kbd>Яндекс.Маркет</kbd> и установить галочку <kbd>API Яндекс.Маркета для партнеров</kbd>. Нажать <b>Создать приложение</b>.
        После создания приложения, вам будет доступен идентификатор приложения <kbd>client_id</kbd>. Необходимо перейти по ссылке https://oauth.yandex.ru/authorize?response_type=token&client_id=ваш client_id заменив в ней <b>ваш client_id</b> на полученный <b>client_id</b>.
        Полученный <b>client_id</b> вписать в поле <kbd>ID приложения Яндекс.OAuth</kbd>, а <b>OAuth-токен</b> в поле <kbd>OAuth-токен</kbd> настроек модуля.</li>
        <li>В личном кабинете Яндекс.Маркет нажать на название магазина, скопировать значение <b>Кампания №</b> в поле <kbd>Идентификатор кампании</kbd> настроек модуля.</li>
        <li>Настроить соответствие статусов заказа в Яндекс.Маркет со статусами заказа в интернет-магазине. При изменении статуса заказа на статус, соответствующий статусам 
        "Статус передан в службу доставки", "Заказ доставлен в пункт самовывоза", "Статус доставлен", "Магазин не может выполнить заказ", 
        "Покупатель решил заменить товар другим по собственной инициативе", "Покупатель отменил заказ по собственным причинам" будет изменен статус заказа в Яндекс.Маркете.</li>
        <li>Настроить соответствие способов оплаты в Яндекс.Маркет со способами оплаты в интернет-магазине.</li>
        </ol>
        
      <h4>Настройка параметров размещения в Яндекс.Маркет по модели FBS</h4>
        <ol>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Настройки</b>/<b>Выбор способа подтверждения</b>, выбрать <b>Как вы будете подтверждать заказы</b> значение <kbd>Через API</kbd></li>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Настройки</b>/<b>Настройка API</b>, указать в поле <kbd>URL для запросов API</kbd> значение <code>https://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/phpshop/modules/yandexcart/api.php</code></li>
        <li>В разделе <b>Настройка API</b> заполнить <kbd>SHA1-отпечаток SSL-сертификата</kbd>, его необходимо взять из информации о SSL сертификате вашего сайта.</li>
        <li>В разделе <b>Настройка API</b> выбрать <b>Тип авторизации</b> <kbd>URL</kbd>.</li>
        <li>В разделе <b>Настройка API</b> включить <kbd>Автоматическое обновление данных об остатках товаров</kbd>.</li>
       </ol>
        <h5>Настройка модуля</h5>
        <ol>
        <li>В модуле выбрать Модель работы <kbd>FBS</kbd>. Нажать кнопку <b>Сохранить</b></li>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Настройки</b>/<b>Настройка API</b> скопировать <kbd>Авторизационный токен</kbd> в поле <kbd>Авторизационный токен API</kbd> в настройках модуля.</li>
        <li>В личном кабинете Яндекс.Маркет открыть <b>Настройки</b>/<b>Настройка API</b>, указать в поле <kbd>URL для запросов API</kbd> значение <code>https://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/phpshop/modules/yandexcart/api.php</code></li>
        <li>Чтобы использовать протокол OAuth при работе с партнерским API, вам необходимо <a href="https://oauth.yandex.ru/client/new" target="_blank">Зарегистрировать свое приложение</a>. 
        Обязательно необходимо ввести название приложения, оно может быть любым. В разделе <b>Платформы</b> установить галочку <kbd>Веб-сервисы</kbd>, под полем <b>Callback URI #1</b> нажать <kbd>Подставить URL для разработки</kbd>.
        В разделе <b>Доступы</b> выбрать <kbd>Яндекс.Маркет</kbd> и установить галочку <kbd>API Яндекс.Маркета для партнеров</kbd>. Нажать <b>Создать приложение</b>.
        После создания приложения, вам будет доступен идентификатор приложения <kbd>client_id</kbd>. Необходимо перейти по ссылке https://oauth.yandex.ru/authorize?response_type=token&client_id=ваш client_id заменив в ней <b>ваш client_id</b> на полученный <b>client_id</b>.
        Полученный <b>client_id</b> вписать в поле <kbd>D приложения Яндекс.OAuth</kbd>, а <b>OAuth-токен</b> в поле <kbd>OAuth-токен</kbd> настроек модуля.</li>
        <li>В личном кабинете Яндекс.Маркет нажать на название магазина, скопировать значение <b>Кампания №</b> в поле <kbd>Идентификатор кампании</kbd> настроек модуля.</li>
        <li>Настроить соответствие статусов заказа в Яндекс.Маркет со статусами заказа в интернет-магазине.</li>
        <li>Настроить соответствие способов оплаты в Яндекс.Маркет со способами оплаты в интернет-магазине.</li>
        <li>Заполнить необходимые данные у товаров (см. раздел <b>Настройка товара</b>).</li>
        <li>Экспортировать товары в Яндекс.Маркет кнопкой <kbd>Экспортировать данные</kbd>.</li>
        </ol>
        
      <h4>Настройка товара</h4>
        <ol>
        <li>В карточке редактирования товара в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.</li>
        <li>Настроить имя и код прозводителя. Имя производителя можно так же указать через характеристику Бренд.</li>
        <li>Настроить опцию вывода наличия у товара гарантии производителя.</li>
        <li>Настроить комментарий. Комментарий используется для отражения информации о минимальной сумме заказа, 
            минимальной партии товара, необходимости предоплаты (указание элемента обязательно) или вариантах оплаты, описания акций и распродаж. Допустимая длина текста в элементе — 50 символов.</li>
        <li>Настроить опцию вывода страны производителя.</li>
        <li>Настроить опцию принадлежности к товарам для взрослых. Обязателен для обозначения товара, имеющего отношение к удовлетворению сексуальных потребностей, 
            либо иным образом эксплуатирующего интерес к сексу.</li>
        <li>Настроить возможность курьерской доставки товара.</li>
        <li>Настроить возможность самовывоза товара из пунктов выдачи.</li>
        <li>Настроить возможность покупки товара в розничном магазине.</li>
        <li>Для размещения по модели FBS у товаров необходимо заполнить <kbd>Вес</kbd>, <kbd>Длина</kbd>, <kbd>Ширина</kbd>, <kbd>Высота</kbd> на вкладке <kbd>Основное</kbd>. 
        И параметры <kbd>Компания производитель, адрес и рег. номер (если есть)</kbd>, <kbd>Страна производства</kbd> на вкладке <kbd>Яндекс</kbd></li>
        </ol>
        
      <h4>Настройка доставки</h4>
        <ol>
        <li>В карточке редактирования доставки в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить максимальное количество дней доставки.
        <li>Настроить время заказа для увеличения срока доставки.
        <li>Настроить опцию вывода доставки для Яндекс.Маркета.
        <li>Настроить опцию принадлежности доставки только для локального региона.
        <li>Настроить параметр типа доставки (Курьерская, Самовывоз или Почта).
        <li>Для режима DBS необходимо включить нужные способы доставки для Яндекс.Маркета. Необходимо нужным способам доставки
            выбрать значение Яндекс.Заказ <kbd>Включить</kbd> 
        <li>Для режима DBS можно выбрать, для какого региона будет отображаться способ доставки. Необходимо заполнить поле <kbd>Регион доставки</kbd> 
        <li>Для режима DBS и Способа доставки <kbd>Самовывоз</kbd> обязательно нужно выбрать минимум одну <kbd>Точку продаж</kbd>. Точки продаж необходимо создать в личном кабинете Яндекс.Маркет.
        </ol>
        
      <h4>Настройка характеристики</h4>
        <ol>
        <li>В карточке редактирования характеристики в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить опцию вывода характеристики для для Яндекс.Маркета. Выделенная хараткеристика выводится в YML файле в тегах "Param"
        <li>Настроить единицу измерения для числовых параметров (дюйм, Мб, кг и т.д.)
        </ol>
        

      <h4>SQL запросы для пакетной обработки</h4>
      <p>
      Для использования SQL команд в большинстве случаев помогает штатная возможность панели управления магазином <kbd>База</kbd> -  <kbd>SQL запрос к базе</kbd>.
      </p>
       <table class="table table-bordered table-striped">
   <thead>
        <tr>
          <th>#</th>
          <th>SQL</th>
          <th>Описание</th>
        </tr>
      </thead>
    <tbody>
        <tr>
          <th scope="row">1</th>
          <td>update phpshop_products set manufacturer_warranty=\'1\';</td>
          <td>Включение гарантии в Яндекс.Маркете для всех товаров</td>
        </tr>
        <tr>
          <th scope="row">2</th>
          <td>update phpshop_products set sales_notes="Минимальная партия - 1шт; минимальная сумма заказа - 1000 руб.";</td>
          <td>Добавляем комментарий ко всем товарам для Яндекс.Маркета</td>
        </tr>
         <tr>
          <th scope="row">3</th>
          <td>update phpshop_products set country_of_origin="Беларусь";</td>
          <td>Добавляем страну производителя ко всем товарам для Яндекс.Маркета</td>
        </tr>
         <tr>
          <th scope="row">4</th>
          <td>update phpshop_products set yml=\'0\' where price<1 or items<1;</td>
          <td>Замена статуса участие в Яндекс.Маркете (убрать из выгрузки) при пустом складе или нулевой цене</td>
        </tr>
         <tr>
          <th scope="row">5</th>
          <td>update phpshop_products set yml=\'1\' where price>0 or items>0;</td>
          <td>Замена статуса участие в Яндекс.Маркете (убрать из выгрузки) при положительном складе или нулевой цене</td>
        </tr>
   </tbody>
</table>
        

        </p>';
    
    return $PHPShopGUI->setInfo($Info, 280, '98%');
}
?>
