<?php

function tab_info($data) {
    global $PHPShopGUI;
    
    $Info = '<p><h4>Получение токена приложения</h4>
        <ol>
        <li>Авторизоваться в Яндексе.
        <li>Перейти по ссылке  <a target="_blank" href="https://oauth.yandex.ru/authorize?response_type=token&client_id=5b5057ed29784d83a5ba85c7c2cae9b9">https://oauth.yandex.ru</a>.
        <li>Разрешить приложению <b>PHPShop Яндекс.Заказ</b> получить доступ к вашим данным на Яндексе.
        <li>Полученный Токен скопировать в поле настройки модуля "Токен для работы с Маркетом".
        </ol>
        
      <h4>Настройки API заказа</h4>
        <ol>
        <li>Перейти в партнерский интерфейс <a target="_blank" href="https://partner.market.yandex.ru/">https://partner.market.yandex.ru</a> в раздел <kbd>Настройка</kbd> - <kbd>Настройки API заказа</kbs>.
        <li>В поле "URL API" указать: <b>https://' . $_SERVER['SERVER_NAME'] . $GLOBALS['SysValue']['dir']['dir'].'/phpshop/modules/yandexcart/api.php</b>
        <li>В поле "SHA1 fingerprint" указать SHA1 подпись вашего SSL сертификата.
        <li>В поле "Авторизационный токен" сгенерировать токен и указать в поле настройки модуля "Пароль авторизации внешних запросов".
        <li>В поле "Тип авторизации" выбрать вариант "URL"
        <li>В поле "Формат данных" выбрать вариант "JSON"
        </ol>
        
      <h4>Настройки параметров размещения</h4>
        <ol>
        <li>В поле "Прайс-лист" указать адрес YML файла: <b>https://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/yml/yandex.php</b>
        </ol>

      <h4>Настройка товара</h4>
        <ol>
        <li>В карточке редактирования товара в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить опцию вывода наличия у товара гарантии производителя.
        <li>Настроить комментарий. Комментарий используется для отражения информации о минимальной сумме заказа, минимальной партии товара, необходимости предоплаты (указание элемента обязательно) или вариантах оплаты, описания акций и распродаж. Допустимая длина текста в элементе — 50 символов.
        <li>Настроить опцию вывода страны производителя.
        <li>Настроить опцию принадлежности к товарам для взрослых. Обязателен для обозначения товара, имеющего отношение к удовлетворению сексуальных потребностей, либо иным образом эксплуатирующего интерес к сексу.
        <li>Настроить возможность курьерской доставки товара.
        <li>Настроить возможность самовывоза товара из пунктов выдачи.
        <li>Настроить возможность покупки товара в розничном магазине.
        </ol>
        
      <h4>Настройка доставки</h4>
        <ol>
        <li>В карточке редактирования доставки в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить максимальное количество дней доставки.
        <li>Настроить опцию вывода доставки для Яндекс.Маркета.
        <li>Настроить опцию принадлежности доставки только дял локального региона.
        <li>Настроить возможный способ оплаты для этой доставки.
        <li>Настроить параметр типа доставки (Курьерская, Самовывоз или Почта).
        <li>Настроить точки продаж и пункты сомовывоза. В поле вписываются ID точек продаж через запятую. Добавить новую точку можно в партнерском интерфейсе Яндекса <kbd>Настройки</kbd> - <kbd>Точки продаж</kbd> - <kbd>+</kbd>
        </ol>
        
      <h4>Настройка характеристики</h4>
        <ol>
        <li>В карточке редактирования характеристики в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить опцию вывода характеристики для для Яндекс.Маркета. Выделенная хараткеристика выводится в YML файле в тегах "Param"
        <li>Настроить единицу измерения для числовых параметров (дюйм, Мб, кг и т.д.)
        </ol>
        

        </p>';
    
    return $PHPShopGUI->setInfo($Info, 280, '98%');
}
?>
