<?php

function tab_info($data) {
    global $PHPShopGUI;
    
    $Info = '<p>
      <h4>Настройки параметров размещения в Яндекс.Маркет</h4>
        <ol>
        <li>В поле "Прайс-лист" указать адрес YML файла: <code>http://' . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/yml/</code>
        </ol>

      <h4>Настройка товара</h4>
        <ol>
        <li>В карточке редактирования товара в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить имя и код прозводителя. Имя производителя можно так же указать через характеристику Бренд.
        <li>Настроить опцию вывода наличия у товара гарантии производителя.
        <li>Настроить комментарий. Комментарий используется для отражения информации о минимальной сумме заказа, минимальной партии товара, необходимости предоплаты (указание элемента обязательно) или вариантах оплаты, описания акций и распродаж. Допустимая длина текста в элементе — 50 символов.
        <li>Настроить опцию вывода страны производителя.
        <li>Настроить опцию принадлежности к товарам для взрослых. Обязателен для обозначения товара, имеющего отношение к удовлетворению сексуальных потребностей, либо иным образом эксплуатирующего интерес к сексу.
        <li>Настроить возможность курьерской доставки товара.
        <li>Настроить возможность самовывоза товара из пунктов выдачи.
        <li>Настроить возможность покупки товара в розничном магазине.
        </ol>
        
      <h4>Настройка доставки</h4>
        <ol>
        <li>В карточке редактирования доставки в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить максимальное количество дней доставки.
        <li>Настроить время заказа для увеличения срока доставки.
        <li>Настроить опцию вывода доставки для Яндекс.Маркета.
        <li>Настроить опцию принадлежности доставки только для локального региона.
        <li>Настроить параметр типа доставки (Курьерская, Самовывоз или Почта).
        </ol>
        
      <h4>Настройка характеристики</h4>
        <ol>
        <li>В карточке редактирования характеристики в закладке <kbd>Яндекс.Заказ</kbd> настроить дополнительные параметры вывода для Яндекс.Маркета.
        <li>Настроить опцию вывода характеристики для для Яндекс.Маркета. Выделенная хараткеристика выводится в YML файле в тегах "Param"
        <li>Настроить единицу измерения для числовых параметров (дюйм, Мб, кг и т.д.)
        </ol>
        

      <h4>SQL запросы для пакетной обработки</h4>
      <p>
      Для использования SQL команд в большинстве случаев помогает штатная возможность панели управления магазином <kbd>База</kbd> -  <kbd>SQL запрос к базе</kbd>.
      </p>
       <table class="table table-bordered table-striped">
   <thead>
        <tr>
          <th>#</th>
          <th>SQL</th>
          <th>Описание</th>
        </tr>
      </thead>
    <tbody>
        <tr>
          <th scope="row">1</th>
          <td>update phpshop_products set manufacturer_warranty=\'1\';</td>
          <td>Включение гарантии в Яндекс.Маркете для всех товаров</td>
        </tr>
        <tr>
          <th scope="row">2</th>
          <td>update phpshop_products set sales_notes="Минимальная партия - 1шт; минимальная сумма заказа - 1000 руб.";</td>
          <td>Добавляем комментарий ко всем товарам для Яндекс.Маркета</td>
        </tr>
         <tr>
          <th scope="row">3</th>
          <td>update phpshop_products set country_of_origin="Беларусь";</td>
          <td>Добавляем страну производителя ко всем товарам для Яндекс.Маркета</td>
        </tr>
         <tr>
          <th scope="row">4</th>
          <td>update phpshop_products set yml=\'0\' where price<1 or items<1;</td>
          <td>Замена статуса участие в Яндекс.Маркете (убрать из выгрузки) при пустом складе или нулевой цене</td>
        </tr>
         <tr>
          <th scope="row">5</th>
          <td>update phpshop_products set yml=\'1\' where price>0 or items>0;</td>
          <td>Замена статуса участие в Яндекс.Маркете (убрать из выгрузки) при положительном складе или нулевой цене</td>
        </tr>
   </tbody>
</table>
        

        </p>';
    
    return $PHPShopGUI->setInfo($Info, 280, '98%');
}
?>
