<?php

function tab_info($data) {
    global $PHPShopGUI;
    
    $Info = '<p>
      <h4>Настройка модуля</h4>
    <ol>
        <li>Зарегистрироваться в <a href="https://seller.ozon.ru" target="_blank">OZON Seller</a> и указать при регистрации промокод <mark>SELLERB7X36A77</mark> для получения <b>5000 бонусов</b> в рекламный кабинет.</li>
        <li>В личном кабинете OZON Seller открыть <a href="https://seller.ozon.ru/app/settings/api-keys" target="_blank">Настройки - API ключи</a>, создать новый API ключ с правами Администратор (Обычный токен, дает доступ ко всем методам API). Необходимо скопировать значение ключа в поле <kbd>API key</kbd> и  значение Client Id в поле <kbd>Client Id</kbd> в настройках модуля.
        </li>
        <li>В настройках модуля включить опцию обновления базу категорий товаров для OZON и нажать <kbd>Сохранить</kbd>. Загрузка базы категорий может занять несколько секунд по причине большого количества категорий в OZON.</li>
        <li>В настройках модуля выбрать статус заказов, поступающих с OZON.</li>
        <li>В настройках модуля выбрать склады с OZON, сопоставляемые с главным складом магазина.</li>
        <li>Для отображения в подробной карточке товара ссылки на товар в OZON используется переменная <code>@ozonseller_link@</code></li>
    </ol>
    
    <h4>Настройка OZON Seller</h4>
    <ol>
      <li>Настроить <a href="https://seller.ozon.ru/app/products/import/products-feed-update" target="_blank">обновление данных</a> о товарах через фид. Добавить в качестве ссылки на фид адрес <code>http://' . $_SERVER['SERVER_NAME'] . '/yml/?marketplace=ozon</code></li>
      <li>В личном кабинете OZON Seller в разделе <a href="https://seller.ozon.ru/app/warehouse" target="_blank">FBS - Логистика</a> добавить склад с именем "Основной".</li>
    </ol>
    
   <h4>Выгрузка товаров в OZON</h4>
   Ozon принимает данные по товарам с четко указанными данными по категориям и характеристикам из базы OZON.
   <ol>
    <li>В карточке редактирования категории в магазине сопоставить выбранную свою категорию с категорией OZON в закладке <kbd>OZON</kbd>, поле <kbd>Размещение в OZON</kbd>. Если выбор категорий пустой, то требуется загрузить базу категорий из настроек модуля. Сохранить выбор и перегрузить страницу, после чего появится блок "Сопоставление характеристик с OZON".</li>
    <li>Сопоставить или создать необходимые характеристики с указанными значениями. Проверить все доступные значения выбранной характеристики можно по ссылке "Доступные значения" под описанием характеристики OZON.</li>
    <li>В карточке редактирования товара в магазине через закладку "Модули - OZON" включить опцию <kbd>Включить экспорт в OZON</kbd> и сохранить данные. Если перегрузить сразу страницу, то выгрузка товара в OZON произойдет сразу и в поле "Статус товара" будет проставлен статус успешной выгрузки товара или выведена ошибка с описанием. Список товаров для выгрузки в OZON доступен в разделе "Модули - OZON Seller - Товары для OZON".</li>
    <li>После успешной выгрузки товары появятся в разделе <a href="https://seller.ozon.ru/app/products?filter=all" target="_blank">Список товаров</a> в OZON.</li>
  </ol>
  
  <h4>Загрузка заказов с OZON</h4>
   <ol>
    <li>Список заказов для загрузки из OZON доступен в разделе "Модули - OZON Seller - Заказы из OZON". По клику на номер заказа откроется карточка с описанием данных по заказу с OZON. Для загрузки заказа используется кнопка <kbd>Загрузить заказ</kbd>. Загруженный заказ будет иметь статус, выбранный в настройках модуля. В поле "Примечания администратора" загруженного заказа будет информация о загрузке с OZON и его номер. Для повторной загрузки заказа следует удалить его из базы заказов в магазине.</li>
    <li>В закладке "Дополнительно" предпросмотра заказа с OZON выводится полная информация по заказу в виде массива данных.</li>
  </ol>
  
 <h4>Загрузка товаров с OZON</h4>
   <ol>
    <li>Список товаров для загрузки из OZON доступен в разделе "Модули - OZON Seller - Товары из OZON". По клику на название товара откроется карточка с описанием данных по товару с OZON. Для загрузки товара используется кнопка <kbd>Загрузить товар</kbd>. Для повторной загрузки товара следует удалить его из базы товаров в магазине. Из OZON загрузятся данные по товару, в том числе изображения и характеристики.</li>
  </ol>
        </p>';
    
    return $PHPShopGUI->setInfo($Info, 280, '98%');
}
?>